License.warranty=<html><body>Distribution License:\
<p>{0} \u0627\u06CC\u0646 \u0628\u0631\u0646\u0627\u0645\u0647 \u0627\u0632\u0627\u062F \u0647\u0633\u062A\u060C \u0634\u0645\u0627 \u0645\u06CC\u062A\u0648\u0627\u0646\u06CC\u062F \u0627\u06CC\u0646 \u0628\u0631\u0646\u0627\u0645\u0647 \u067E\u062E\u0634 \u06A9\u0646\u06CC\u062F \u06CC\u0627 \u0639\u0648\u0633 \u06A9\u0646\u06CC\u062F\u0633\u06CC\u0631 \u0644\u06CC\u0634\u0627\u0646\u0633\u060C \
GNU General Public License, version 2 \u0627\u0632 Free Software Foundation. \
\u0627\u06CC\u0646 \u0628\u0631\u0646\u0627\u0645\u0647 \u067E\u062E\u0634 \u06A9\u0631\u062F\u06CC\u0645 \u0628\u0627 \u0627\u0645\u06CC\u062F \u06A9\u0647 \u06A9\u0647 \u0628\u0631\u0646\u0627\u0645\u0647 \u0628\u0627 \u0646\u0641\u0633 \u0647\u0633\u062A\u060C \u0648\u0644\u06CC \u0628\u0647\u062F\u0648\u0646\u0647 \u0647\u06CC\u0686 \u063A\u0644 \u06A9\u0647 \u06A9\u0627\u0631 \u0645\u06CC\u06A9\u0646\u062F\u060C \u0647\u062F\u0641\u0634 \u0627\u0646\u062C\u0627\u0645 \u0645\u06CC\u06A9\u0646\u062F \u06CC\u0627 \u06A9\u0647 \u0627\u06CC\u0646 \u0628\u0631\u0646\u0627\u0645\u0647 \u0646\u0641\u0633 \u062F\u06CC\u06AF\u0631 \u062F\u0627\u0631\u062F.   \

GNU General Public License \u0628\u062E\u0648\u0627\u0646\u06CC\u062F \u0628\u0631\u0627\u06CC \u0639\u062A\u0644\u0648\u0639\u062A \u0628\u06CC\u0634\u062A\u0631 .</p>\
<br>\
\u0644\u06CC\u0633\u0627\u0646\u0633 \u062F\u0631 \u0627\u06CC\u0646\u062A\u0631\u0646\u062A :<br>\
&nbsp;&nbsp;&nbsp;&nbsp;http://www.gnu.org/copyleft/gpl.html<br>\
\u0627\u062F\u0631\u0633 \u067E\u0648\u0633\u062A\u06CC:<br>\
&nbsp;&nbsp;&nbsp;&nbsp;Free Software Foundation, Inc.<br>\
&nbsp;&nbsp;&nbsp;&nbsp;59 Temple Place - Suite 330<br>\
&nbsp;&nbsp;&nbsp;&nbsp;Boston, MA 02111-1307, USA<br>\
<br>\
Copyright: 2005<br>\
&nbsp;&nbsp;&nbsp;&nbsp;The copyright to this program is held by it's authors.</body></html>

License.details=<html><body>{0} is covered by the GNU General Public License<br>\
<p><span style="font-size: 14pt; font-family: Arial; color: black;">This \
is an unofficial translation of the GNU General Public License into <em> \
<span style="font-family: Arial;">Persian</span></em>. It was not published by \
the Free Software Foundation, and does not legally state the distribution terms \
for software that uses the GNU GPL--only the original English text of the GNU \
GPL does that. However, we hope that this translation will help <em> \
<span style="font-family: Arial;">Persian</span></em> speakers understand the GNU \
GPL better. </span></p> \
<p class="MsoNormal" dir="rtl" style="text-align: right; direction: rtl; unicode-bidi: embed;"> \
<span style="font-size: 14pt;" lang="FA">&nbsp;\u0627\u06cc\u0646 \u06cc\u06a9 \u062a\u0631\u062c\u0645\u0647 \u063a\u06cc\u0631 \u0631\u0633\u0645\u06cc \u0627\u0632 </span> \
<span dir="ltr" style="font-size: 14pt;">GNU General Public License</span><span style="font-size: 14pt;" lang="FA"> \
\u0628\u0647 \u0632\u0628\u0627\u0646 \u0641\u0627\u0631\u0633\u06cc \u0645\u06cc \u0628\u0627\u0634\u062f. \u0627\u06cc\u0646 \u062a\u0631\u062c\u0645\u0647 \u062a\u0648\u0633\u0637 \u0628\u0646\u06cc\u0627\u062f \u0646\u0631\u0645 \u0627\u0641\u0632\u0627\u0631\u0647\u0627\u06cc \u0622\u0632\u0627\u062f \u0627\u0646\u062a\u0634\u0627\u0631 \u0646\u06cc\u0627\u0641\u062a\u0647 \u0648 \u0627\u0632 \
\u0644\u062d\u0627\u0638 \u0642\u0627\u0646\u0648\u0646\u06cc \u0645\u0631\u062c\u0639\u06cc \u0628\u0631\u0627\u06cc \u0645\u0642\u0631\u0631\u0627\u062a \u062a\u0648\u0632\u06cc\u0639 \u0646\u0631\u0645 \u0627\u0641\u0632\u0627\u0631 \u062a\u062d\u062a \u067e\u0631\u0648\u0627\u0646\u0647 </span> \
<span dir="ltr" style="font-size: 14pt;">GNU</span><span style="font-size: 14pt;" lang="FA"> \
\u0646\u0645\u06cc \u0628\u0627\u0634\u062f \u2013 \u0641\u0642\u0637 \u0645\u062a\u0646 \u067e\u0631\u0648\u0627\u0646\u0647 \u0628\u0647 \u0632\u0628\u0627\u0646 \u0627\u0646\u06af\u0644\u06cc\u0633\u06cc \u0686\u0646\u06cc\u0646 \u0645\u0631\u062c\u0639\u06cc \u0628\u0631\u0634\u0645\u0631\u062f\u0647 \u0645\u06cc \u0634\u0648\u062f. \u0628\u0647 \u0647\u0631 \
\u062a\u0631\u062a\u06cc\u0628\u060c \u0645\u0627 \u0627\u0645\u06cc\u062f\u0648\u0627\u0631\u06cc\u0645 \u0627\u06cc\u0646 \u062a\u0631\u062c\u0645\u0647 \u0628\u0647 \u0622\u0634\u0646\u0627\u06cc\u06cc \u0641\u0627\u0631\u0633\u06cc \u0632\u0628\u0627\u0646\u0627\u0646 \u0628\u0627 \u067e\u0631\u0648\u0627\u0646\u0647 </span> \
<span dir="ltr" style="font-size: 14pt;">GNU</span><span style="font-size: 14pt;" lang="FA"> \
\u06a9\u0645\u06a9 \u06a9\u0646\u062f.&nbsp; </span></p> \
<p class="MsoNormal" dir="rtl" style="text-align: right; direction: rtl; unicode-bidi: embed;"> \
<span style="font-size: 14pt;" lang="FA">&nbsp;</span></p> \
<p class="MsoNormal" dir="rtl" style="text-align: right; direction: rtl; unicode-bidi: embed;"> \
<span style="font-size: 14pt;" lang="FA">\u0646\u0633\u062e\u0647 2 \u2013 \u062e\u0631\u062f\u0627\u062f 1370</span></p> \
<p class="MsoNormal" dir="rtl" style="text-align: right; direction: rtl; unicode-bidi: embed;"> \
<span style="font-size: 14pt;" lang="FA">\u062d\u0642 \u062a\u0627\u0644\u06cc\u0641 \u0628\u0631\u0627\u06cc </span> \
<span dir="ltr" style="font-size: 14pt;">Free Software Foundation, Inc.</span><span style="font-size: 14pt;" lang="FA"> \
\u0628\u0647 \u0622\u062f\u0631\u0633</span><span dir="ltr" style="font-size: 14pt;"><br> \
59 Temple Place \u2013 Suite 330, Boston, MA 02111-1307, USA</span><span style="font-size: 14pt;" lang="FA"> \
\u0645\u062d\u0641\u0648\u0638 \u0645\u06cc \u0628\u0627\u0634\u062f.</span></p> \
<p class="MsoNormal" dir="rtl" style="text-align: right; direction: rtl; unicode-bidi: embed;"> \
<span style="font-size: 14pt;" lang="FA">\u0647\u0631\u06a9\u0633\u06cc \u0645\u062c\u0627\u0632 \u0628\u0647 \u062a\u06a9\u062b\u06cc\u0631 \u0648 \u06cc\u0627 \u062a\u0648\u0632\u06cc\u0639 \u0644\u0641\u0638 \u0628\u0647 \
\u0644\u0641\u0638 \u0648 \u062f\u0633\u062a \u0646\u062e\u0648\u0631\u062f\u0647 \u0627\u06cc\u0646 \u067e\u0631\u0648\u0627\u0646\u0647 \u0645\u06cc \u0628\u0627\u0634\u062f\u060c \u0627\u0645\u0627</span><span dir="ltr" style="font-size: 14pt;" lang="FA"> \
</span><span style="font-size: 14pt;" lang="FA">&nbsp;\u0647\u06cc\u0686\u06a9\u0633 \u0645\u062c\u0627\u0632 \u0628\u0647 \u062a\u063a\u06cc\u06cc\u0631 \u0622\u0646 \u0646\u06cc\u0633\u062a.</span></p> \
<p class="MsoNormal" dir="rtl" style="text-align: right; direction: rtl; unicode-bidi: embed;"> \
<span style="font-size: 14pt;" lang="FA">&nbsp;</span></p> \
<p class="MsoNormal" dir="rtl" style="text-align: right; direction: rtl; unicode-bidi: embed;"> \
<span style="font-size: 14pt;" lang="FA">\u062f\u06cc\u0628\u0627\u0686\u0647</span></p> \
<p class="MsoNormal" dir="rtl" style="text-align: right; direction: rtl; unicode-bidi: embed;"> \
<span style="font-size: 14pt;" lang="FA">\u067e\u0631\u0648\u0627\u0646\u0647 \u0627\u0633\u062a\u0641\u0627\u062f\u0647 \u0627\u0632 \u0628\u0633\u06cc\u0627\u0631\u06cc \u0627\u0632 \u0646\u0631\u0645 \
\u0627\u0641\u0632\u0627\u0631\u0647\u0627 \u0628\u06af\u0648\u0646\u0647 \u0627\u06cc \u0637\u0631\u0627\u062d\u06cc \u0634\u062f\u0647 \u062a\u0627 \u0622\u0632\u0627\u062f\u06cc \u0634\u0645\u0627 \u0628\u0631\u0627\u06cc \u062a\u0633\u0647\u06cc\u0645&nbsp; \u0648 \u062a\u063a\u06cc\u06cc\u0631 \u0622\u0646\u0647\u0627 \u0631\u0627 \u0628\u06af\u06cc\u0631\u062f\u060c \u062f\u0631 \
\u0645\u0642\u0627\u0628\u0644 </span><span dir="ltr" style="font-size: 14pt;">GNU General Public \
License</span><span style="font-size: 14pt;" lang="FA"> \u0628\u0631 \u0622\u0646 \u0627\u0633\u062a \u062a\u0627 \u0627\u0632 \u0622\u0632\u0627\u062f\u06cc \
\u0634\u0645\u0627 \u0628\u0631\u0627\u06cc \u062a\u0633\u0647\u06cc\u0645 \u0648 \u062a\u063a\u06cc\u06cc\u0631 \u0646\u0631\u0645 \u0627\u0641\u0632\u0627\u0631 \u062f\u0641\u0627\u0639 \u06a9\u0646\u062f \u2013 \u0628\u0631\u0627\u06cc \u062d\u0635\u0648\u0644 \u0627\u0637\u0645\u06cc\u0646\u0627\u0646 \u0627\u0632 \u0622\u0632\u0627\u062f \u0628\u0648\u062f\u0646 \u0646\u0631\u0645 \
\u0627\u0641\u0632\u0627\u0631 \u0628\u0631\u0627\u06cc \u062a\u0645\u0627\u0645 \u06a9\u0627\u0631\u0628\u0631\u0627\u0646 \u0622\u0646.</span></p> \
<p class="MsoNormal" dir="rtl" style="text-align: right; direction: rtl; unicode-bidi: embed;"> \
<span style="font-size: 14pt;" lang="FA">\u0627\u06cc\u0646 \u067e\u0631\u0648\u0627\u0646\u0647 \u062c\u0627\u0645\u0639 \u0647\u0645\u06af\u0627\u0646\u06cc</span><span dir="ltr" style="font-size: 14pt;">(GPL) \
</span><span style="font-size: 14pt;" lang="FA">&nbsp;\u062f\u0631 \u0645\u0648\u0631\u062f \u0627\u06a9\u062b\u0631 \u0646\u0631\u0645 \u0627\u0641\u0632\u0627\u0631\u0647\u0627\u06cc \
\u0628\u0646\u06cc\u0627\u062f \u0646\u0631\u0645 \u0627\u0641\u0632\u0627\u0631\u0647\u0627\u06cc \u0622\u0632\u0627\u062f </span><span dir="ltr" style="font-size: 14pt;">(Free \
Software Foundation)</span><span style="font-size: 14pt;" lang="FA"> \u0648 \u0647\u0631 \
\u0628\u0631\u0646\u0627\u0645\u0647 \u062f\u06cc\u06af\u0631\u06cc \u06a9\u0647 \u0645\u0648\u0644\u0641\u06cc\u0646 \u0622\u0646 \u0645\u062a\u0639\u0647\u062f \u0628\u0647 \u067e\u0631\u0648\u0627\u0646\u0647 \u06cc\u0627\u062f \u0634\u062f\u0647 \u0647\u0633\u062a\u0646\u062f \u0627\u0639\u0645\u0627\u0644 \u0645\u06cc \u06af\u0631\u062f\u062f.(\u0628\u0642\u06cc\u0647 \u0646\u0631\u0645 \
\u0627\u0641\u0632\u0627\u0631\u0647\u0627\u06cc \u0628\u0646\u06cc\u0627\u062f \u0646\u0627\u0645 \u0628\u0631\u062f\u0647 \u0634\u062f\u0647 \u0627\u0632 </span><span dir="ltr" style="font-size: 14pt;"> \
GNU Library General Public License</span><span style="font-size: 14pt;" lang="FA"> \
\u0627\u0633\u062a\u0641\u0627\u062f\u0647 \u0645\u06cc \u06a9\u0646\u0646\u062f.) \u0634\u0645\u0627 \u0647\u0645 \u0645\u06cc \u062a\u0648\u0627\u0646\u06cc\u062f \u0627\u06cc\u0646 \u067e\u0631\u0648\u0627\u0646\u0647 \u0631\u0627 \u0628\u0631\u0627\u06cc \u0646\u0631\u0645 \u0627\u0641\u0632\u0627\u0631\u062a\u0627\u0646 \u0628\u06a9\u0627\u0631 \u0628\u0628\u0631\u06cc\u062f.</span></p> \
<p class="MsoNormal" dir="rtl" style="text-align: right; direction: rtl; unicode-bidi: embed;"> \
<span style="font-size: 14pt;" lang="FA">\u0648\u0642\u062a\u06cc \u0645\u0627 \u0627\u0632 \u0646\u0631\u0645 \u0627\u0641\u0632\u0627\u0631 \u0622\u0632\u0627\u062f \u0635\u062d\u0628\u062a \u0645\u06cc \
\u06a9\u0646\u06cc\u0645\u060c \u0628\u0647 \u0622\u0632\u0627\u062f\u06cc \u0627\u0634\u0627\u0631\u0647 \u0645\u06cc \u06a9\u0646\u06cc\u0645 \u0646\u0647 \u0642\u06cc\u0645\u062a. \u067e\u0631\u0648\u0627\u0646\u0647 \u0647\u0627\u06cc \u0645\u0627 \u0637\u0648\u0631\u06cc \u0637\u0631\u0627\u062d\u06cc \u0634\u062f\u0647 \u0627\u0646\u062f \u062a\u0627 \u0627\u0632 \
\u0627\u0645\u06a9\u0627\u0646 \u062a\u0648\u0632\u06cc\u0639 \u0622\u0632\u0627\u062f \u0646\u0633\u062e\u0647 \u0647\u0627\u06cc \u0646\u0631\u0645 \u0627\u0641\u0632\u0627\u0631\u0647\u0627 \u062a\u0648\u0633\u0637 \u0634\u0645\u0627 \u0648\u062c\u0648\u062f \u062f\u0627\u0634\u062a\u0647 \u0628\u0627\u0634\u062f (\u062d\u062a\u06cc \u0627\u062c\u0627\u0632\u0647 \u062f\u0627\u0631\u06cc\u062f \
\u0628\u0631\u0627\u06cc \u0627\u06cc\u0646\u06a9\u0627\u0631\u060c \u062a\u0648\u0632\u06cc\u0639\u060c \u0645\u0628\u0644\u063a\u06cc \u062f\u0631\u06cc\u0627\u0641\u062a \u06a9\u0646\u06cc\u062f)</span><span dir="ltr" style="font-size: 14pt;" lang="FA"> \
</span><span style="font-size: 14pt;" lang="FA">\u0627\u06cc\u0646\u06a9\u0647 \u0634\u0645\u0627 \u06a9\u062f \u0627\u0635\u0644\u06cc \u0628\u0631\u0646\u0627\u0645\u0647 </span> \
<span dir="ltr" style="font-size: 14pt;">(Source Code)</span><span style="font-size: 14pt;"> \
<span lang="FA">\u0631\u0627 \u062f\u0631\u06cc\u0627\u0641\u062a \u06a9\u0646\u06cc\u062f \u0648 \u06cc\u0627 \u062f\u0631 \u0635\u0648\u0631\u062a \u0646\u06cc\u0627\u0632 \u0627\u0645\u06a9\u0627\u0646 \u062f\u0631\u06cc\u0627\u0641\u062a \u0622\u0646 \u0631\u0627 \u062f\u0627\u0634\u062a\u0647 \u0628\u0627\u0634\u06cc\u062f\u060c \
\u0627\u06cc\u0646\u06a9\u0647 \u0634\u0645\u0627 \u0628\u062a\u0648\u0627\u0646\u06cc\u062f \u062f\u0631 \u0628\u0631\u0646\u0627\u0645\u0647 \u062f\u062e\u0644 \u0648 \u062a\u0635\u0631\u0641 \u06a9\u0646\u06cc\u062f \u0648 \u06cc\u0627 \u0642\u0633\u0645\u062a\u0647\u0627\u06cc\u06cc \u0627\u0632 \u0622\u0646 \u0631\u0627 \u062f\u0631 \u0628\u0631\u0646\u0627\u0645\u0647 \u0647\u0627\u06cc \
\u0631\u0627\u06cc\u06af\u0627\u0646 \u062f\u06cc\u06af\u0631\u06cc \u0627\u0633\u062a\u0641\u0627\u062f\u0647 \u06a9\u0646\u06cc\u062f \u0648 \u0627\u06cc\u0646\u06a9\u0647 \u0645\u0637\u0645\u0626\u0646 \u0628\u0627\u0634\u06cc\u062f \u0645\u06cc \u062a\u0648\u0627\u0646\u06cc\u062f \u0647\u0645\u0647 \u0627\u06cc\u0646\u06a9\u0627\u0631\u0647\u0627 \u0631\u0627 \u0628\u06a9\u0646\u06cc\u062f.</span></span></p> \
<p class="MsoNormal" dir="rtl" style="text-align: right; direction: rtl; unicode-bidi: embed;"> \
<span style="font-size: 14pt;" lang="FA">\u0628\u0631\u0627\u06cc \u062d\u0641\u0638 \u062d\u0642\u0648\u0642 \u0634\u0645\u0627\u060c \u0645\u0627 \u0628\u0627\u06cc\u062f \u0645\u062d\u062f\u0648\u062f\u06cc\u062a\u0647\u0627\u06cc\u06cc \
\u0648\u0636\u0639 \u06a9\u0646\u06cc\u0645 \u06a9\u0647 \u062c\u0644\u0648\u06cc \u0647\u0631\u06a9\u0633\u06cc \u0631\u0627 \u06a9\u0647 \u0628\u062e\u0648\u0627\u0647\u062f \u0627\u06cc\u0646 \u062d\u0642\u0648\u0642 \u0631\u0627 \u0627\u0632 \u0634\u0645\u0627 \u0635\u0644\u0628 \u06a9\u0646\u062f \u06af\u0631\u0641\u062a\u0647 \u0634\u0648\u062f. \u062f\u0631 \
\u0635\u0648\u0631\u062a\u06cc \u06a9\u0647 \u0634\u0645\u0627 \u0646\u0633\u062e\u0647 \u0647\u0627\u06cc\u06cc \u0627\u0632 \u0646\u0631\u0645 \u0627\u0641\u0632\u0627\u0631 \u0631\u0627 \u062a\u0648\u0632\u06cc\u0639 \u0645\u06cc \u06a9\u0646\u06cc\u062f \u0648 \u06cc\u0627 \u062a\u063a\u06cc\u06cc\u0631\u0627\u062a\u06cc \u062f\u0631 \u0622\u0646 \u0627\u06cc\u062c\u0627\u062f \
\u0645\u06cc \u06a9\u0646\u06cc\u062f \u0627\u06cc\u0646 \u0645\u062d\u062f\u0648\u062f\u06cc\u062a\u0647\u0627 \u0634\u0627\u0645\u0644 \u0645\u0633\u0648\u0648\u0644\u06cc\u062a\u0647\u0627\u06cc \u0645\u0634\u062e\u0635\u06cc \u0628\u0631\u0627\u06cc \u0634\u0645\u0627 \u062e\u0648\u0627\u0647\u062f \u0628\u0648\u062f.</span></p> \
<p class="MsoNormal" dir="rtl" style="text-align: right; direction: rtl; unicode-bidi: embed;"> \
<span style="font-size: 14pt;" lang="FA">\u0628\u0631\u0627\u06cc \u0646\u0645\u0648\u0646\u0647\u060c \u0627\u06af\u0631 \u0634\u0645\u0627 \u0646\u0633\u062e\u0647 \u0647\u0627\u06cc\u06cc \u0627\u0632 \u0686\u0646\u06cc\u0646 \
\u0646\u0631\u0645 \u0627\u0641\u0632\u0627\u0631\u06cc \u0631\u0627 \u062a\u0648\u0632\u06cc\u0639 \u0645\u06cc \u06a9\u0646\u06cc\u062f\u060c \u0686\u0647 \u0628\u0647 \u0631\u0627\u06cc\u06af\u0627\u0646 \u0648 \u06cc\u0627 \u062f\u0631 \u0627\u0632\u0627\u06cc \u062f\u0631\u06cc\u0627\u0641\u062a \u062d\u0642 \u0627\u0644\u0632\u062d\u0645\u0647\u060c \u0634\u0645\u0627 \
\u0628\u0627\u06cc\u062f \u062a\u0645\u0627\u0645 \u062d\u0642\u0648\u0642\u06cc \u06a9\u0647 \u062f\u0627\u0631\u06cc\u062f \u0631\u0627 \u0628\u0647 \u062f\u0631\u06cc\u0627\u0641\u062a \u06a9\u0646\u0646\u062f\u0647 \u0646\u06cc\u0632 \u0627\u0639\u0637\u0627 \u06a9\u0646\u06cc\u062f\u060c \u0634\u0645\u0627 \u0628\u0627\u06cc\u062f \u0627\u0637\u0645\u06cc\u0646\u0627\u0646 \u062d\u0627\u0635\u0644 \
\u06a9\u0646\u06cc\u062f \u06a9\u0647 \u0622\u0646\u0647\u0627 \u0647\u0645 \u0645\u06cc \u062a\u0648\u0627\u0646\u0646\u062f \u06a9\u062f \u0627\u0635\u0644\u06cc \u0628\u0631\u0646\u0627\u0645\u0647 \u0631\u0627 \u0628\u06af\u06cc\u0631\u0646\u062f \u0648 \u0634\u0645\u0627 \u0645\u06cc \u0628\u0627\u06cc\u0633\u062a \u0627\u06cc\u0646 \u0642\u0648\u0627\u0646\u06cc\u0646 \u0631\u0627 \
\u062f\u0631 \u0627\u062e\u062a\u06cc\u0627\u0631 \u0622\u0646\u0647\u0627 \u0642\u0631\u0627\u0631 \u062f\u0647\u06cc\u062f \u062a\u0627 \u0627\u0632 \u062d\u0642\u0648\u0642 \u062e\u0648\u062f \u0622\u06af\u0627\u0647 \u06af\u0631\u062f\u0646\u062f.</span></p> \
<p class="MsoNormal" dir="rtl" style="text-align: right; direction: rtl; unicode-bidi: embed;"> \
<span style="font-size: 14pt;" lang="FA">\u0645\u0627 \u062f\u0631 \u062f\u0648 \u0645\u0631\u062d\u0644\u0647 \u0627\u0632 \u062d\u0642\u0648\u0642 \u0634\u0645\u0627 \u062f\u0641\u0627\u0639 \u0645\u06cc \
\u06a9\u0646\u06cc\u0645: (1) \u062d\u0642 \u0627\u0644\u062a\u0627\u0644\u06cc\u0641 \u0646\u0631\u0645 \u0627\u0641\u0632\u0627\u0631 \u0648 (2) \u0627\u0631\u0627\u06cc\u0647 \u06a9\u0631\u062f\u0646 \u0627\u06cc\u0646 \u067e\u0631\u0648\u0627\u0646\u0647 \u0628\u0647 \u0634\u0645\u0627 \u06a9\u0647 \u062d\u0642 \u0642\u0627\u0646\u0648\u0646\u06cc \
\u0634\u0645\u0627 \u0628\u0631\u0627\u06cc \u062a\u06a9\u062b\u06cc\u0631\u060c \u062a\u0648\u0632\u06cc\u0639 \u0648 \u06cc\u0627 \u062a\u063a\u06cc\u06cc\u0631 \u0646\u0631\u0645 \u0627\u0641\u0632\u0627\u0631 \u0631\u0627 \u0641\u0631\u0627\u0647\u0645 \u0645\u06cc \u0622\u0648\u0631\u062f.</span></p> \
<p class="MsoNormal" dir="rtl" style="text-align: right; direction: rtl; unicode-bidi: embed;"> \
<span style="font-size: 14pt;" lang="FA">\u062f\u0631 \u0636\u0645\u0646\u060c \u0628\u0631\u0627\u06cc \u062d\u0641\u0627\u0638\u062a \u0627\u0632 \u062d\u0642\u0648\u0642 \u0647\u0631 \u0645\u0648\u0644\u0641 \u0648 \
\u0647\u0645\u0686\u0646\u06cc\u0646 \u062e\u0648\u062f\u0645\u0627\u0646\u060c \u0644\u0627\u0632\u0645 \u0645\u06cc \u062f\u0627\u0646\u06cc\u0645 \u0628\u0631\u0627\u06cc \u0647\u0645\u0647 \u0631\u0648\u0634\u0646 \u06a9\u0646\u06cc\u0645 \u06a9\u0647 \u0647\u06cc\u0686 \u06af\u0648\u0646\u0647 \u062a\u0639\u0647\u062f\u06cc \u0628\u0631\u0627\u06cc \u0627\u06cc\u0646 \u0646\u0631\u0645 \
\u0627\u0641\u0632\u0627\u0631 \u0622\u0632\u0627\u062f \u0648\u062c\u0648\u062f \u0646\u062f\u0627\u0631\u062f. \u0627\u06af\u0631 \u0646\u0631\u0645 \u0627\u0641\u0632\u0627\u0631\u06cc \u062a\u0648\u0633\u0637 \u0634\u062e\u0635 \u062f\u06cc\u06af\u0631\u06cc \u0628\u062c\u0632 \u0645\u0648\u0644\u0641 \u062a\u063a\u06cc\u06cc\u0631 \u0645\u06cc \u06a9\u0646\u062f \u0648 \u0633\u067e\u0633 \
\u0628\u0647 \u062f\u06cc\u06af\u0631\u0627\u0646 \u0645\u0646\u062a\u0642\u0644 \u0645\u06cc \u0634\u0648\u062f \u0645\u0627 \u0645\u06cc \u062e\u0648\u0627\u0647\u06cc\u0645 \u06af\u06cc\u0631\u0646\u062f\u06af\u0627\u0646 \u0622\u06af\u0627\u0647 \u0628\u0627\u0634\u0646\u062f \u06a9\u0647 \u0646\u0631\u0645 \u0627\u0641\u0632\u0627\u0631 \u0645\u0648\u0631\u062f \
\u0627\u0633\u062a\u0641\u0627\u062f\u0647 \u0646\u0633\u062e\u0647 \u062a\u063a\u06cc\u06cc\u0631 \u06cc\u0627\u0641\u062a\u0647 \u0627\u06cc\u0633\u062a \u0648 \u062f\u0631 \u0646\u062a\u06cc\u062c\u0647 \u0627\u06cc\u0631\u0627\u062f \u06a9\u0627\u0631 \u062f\u06cc\u06af\u0631\u0627\u0646 \u0628\u0647 \u062d\u0633\u0627\u0628 \u0645\u0648\u0644\u0641 \u0627\u0635\u0644\u06cc \
\u06af\u0630\u0627\u0634\u062a\u0647 \u0646\u0634\u0648\u062f.</span></p> \
<p class="MsoNormal" dir="rtl" style="text-align: right; direction: rtl; unicode-bidi: embed;"> \
<span style="font-size: 14pt;" lang="FA">\u062f\u0631 \u0646\u0647\u0627\u06cc\u062a\u060c \u0647\u0631 \u0628\u0631\u0646\u0627\u0645\u0647 \u0622\u0632\u0627\u062f \u0647\u0645\u0648\u0627\u0631\u0647 \u0627\u0632 \u0637\u0631\u0641 \
\u0627\u0645\u062a\u06cc\u0627\u0632\u0647\u0627\u06cc \u0627\u0646\u062d\u0635\u0627\u0631\u06cc \u0646\u0631\u0645 \u0627\u0641\u0632\u0627\u0631\u06cc </span><span dir="ltr" style="font-size: 14pt;"> \
(Software Patents)</span><span style="font-size: 14pt;" lang="FA"> \u062a\u0647\u062f\u06cc\u062f \u0645\u06cc \u0634\u0648\u062f \
\u0648 \u062f\u0631 \u0646\u062a\u06cc\u062c\u0647 \u0645\u0627 \u0633\u0639\u06cc \u0645\u06cc \u06a9\u0646\u06cc\u0645 \u0627\u0632 \u0627\u06cc\u0646 \u062f\u0631\u06cc\u0627\u0641\u062a \u062d\u0642 \u0627\u0645\u062a\u06cc\u0627\u0632 \u0627\u0646\u062d\u0635\u0627\u0631\u06cc \u062a\u0648\u0633\u0637 \u062a\u0648\u0632\u06cc\u0639 \u06a9\u0646\u0646\u062f\u06af\u0627\u0646 \u0646\u0631\u0645 \
\u0627\u0641\u0632\u0627\u0631\u0647\u0627\u06cc \u0622\u0632\u0627\u062f \u0627\u062c\u062a\u0646\u0627\u0628 \u06a9\u0646\u06cc\u0645. \u0628\u0631\u0627\u06cc \u062c\u0644\u0648\u06af\u06cc\u0631\u06cc \u0627\u0632 \u0648\u0642\u0648\u0639 \u0686\u0646\u06cc\u0646 \u0686\u06cc\u0632\u06cc \u0628\u0637\u0648\u0631 \u0648\u0627\u0636\u062d \u0631\u0648\u0634\u0646 \u0633\u0627\u062e\u062a\u0647 \
\u0627\u06cc\u0645 \u06a9\u0647 \u0647\u0631 \u062d\u0642 \u0627\u0645\u062a\u06cc\u0627\u0632 \u0645\u06cc \u0628\u0627\u06cc\u0633\u062a \u0628\u0631\u0627\u06cc \u0645\u0635\u0631\u0641 \u0622\u0632\u0627\u062f \u0647\u0645\u06af\u0627\u0646 \u062b\u0628\u062a \u06af\u0631\u062f\u062f \u0648 \u06cc\u0627 \u0627\u0635\u0644\u0627" \u062b\u0628\u062a \u0646\u06af\u0631\u062f\u062f.</span></p> \
<p class="MsoNormal" dir="rtl" style="text-align: right; direction: rtl; unicode-bidi: embed;"> \
<span style="font-size: 14pt;" lang="FA">\u062f\u0631 \u0627\u062f\u0627\u0645\u0647 \u0642\u0648\u0627\u0646\u06cc\u0646 \u0648 \u0645\u0642\u0631\u0631\u0627\u062a \u062c\u0627\u0645\u0639 \u062a\u06a9\u062b\u06cc\u0631\u060c \
\u062a\u0648\u0632\u06cc\u0639 \u0648 \u062a\u063a\u06cc\u06cc\u0631 \u0645\u06cc \u0622\u06cc\u062f.</span></p> \
<p class="MsoNormal" dir="rtl" style="text-align: right; direction: rtl; unicode-bidi: embed;"> \
<span style="font-size: 14pt;" lang="FA">&nbsp;</span></p> \
<p class="MsoNormal" dir="rtl" style="text-align: right; direction: rtl; unicode-bidi: embed;"> \
<span style="font-size: 14pt;" lang="FA">\u0642\u0648\u0627\u0646\u06cc\u0646 \u0648 \u0645\u0642\u0631\u0631\u0627\u062a \u062a\u06a9\u062b\u06cc\u0631\u060c \u062a\u0648\u0632\u06cc\u0639 \u0648 \u062a\u063a\u06cc\u06cc\u0631</span></p> \
<p class="MsoNormal" dir="rtl" style="text-align: right; direction: rtl; unicode-bidi: embed;"> \
<span style="font-size: 14pt;" lang="FA">&nbsp;</span></p> \
<p class="MsoNormal" dir="rtl" style="text-align: right; text-indent: -18pt; direction: rtl; unicode-bidi: embed; margin-right: 36pt;"> \
<span style="font-size: 14pt;">0.<span style="font-style: normal; font-variant: normal; font-weight: normal; font-size: 7pt; font-family: Times New Roman;">&nbsp;&nbsp;&nbsp;&nbsp; \
</span></span><span style="font-size: 14pt;" dir="rtl" lang="FA">\u0627\u06cc\u0646 \u067e\u0631\u0648\u0627\u0646\u0647 \u0628\u0631 \
\u0647\u0631 \u0628\u0631\u0646\u0627\u0645\u0647 \u06cc\u0627 \u06a9\u0627\u0631\u06cc \u06a9\u0647 \u0635\u0627\u062d\u0628 \u062d\u0642 \u0627\u0645\u062a\u06cc\u0627\u0632 \u0622\u0646 \u0627\u0639\u0644\u0627\u0646\u06cc\u0647 \u0627\u06cc \u0645\u0628\u062a\u0646\u06cc \u0628\u0631 \u062a\u0648\u0632\u06cc\u0639 \u0622\u0646 \u0628\u0631 \u0627\u0633\u0627\u0633 \
\u0642\u0648\u0627\u0646\u06cc\u0646 \u0627\u06cc\u0646 \u067e\u0631\u0648\u0627\u0646\u0647 \u0628\u0647 \u0622\u0646 \u0627\u0644\u062d\u0627\u0642 \u06a9\u0631\u062f\u0647 \u0628\u0627\u0634\u062f \u0627\u0639\u0645\u0627\u0644 \u0645\u06cc \u06af\u0631\u062f\u062f. \u0627\u0632 \u0627\u06cc\u0646 \u067e\u0633 " \u0628\u0631\u0646\u0627\u0645\u0647" \u0628\u0647 \
\u0686\u0646\u06cc\u0646 \u0646\u0631\u0645 \u0627\u0641\u0632\u0627\u0631 \u0648 \u06cc\u0627 \u06a9\u0627\u0631\u06cc \u0627\u0637\u0644\u0627\u0642 \u0645\u06cc \u0634\u0648\u062f \u0648 " \u06a9\u0627\u0631 \u0628\u0631\u0627\u0633\u0627\u0633 \u0628\u0631\u0646\u0627\u0645\u0647 " \u0628\u0647 \u0645\u0639\u0646\u06cc \u062e\u0648\u062f \u0628\u0631\u0646\u0627\u0645\u0647 \
\u0648 \u06cc\u0627 \u0647\u0631\u06a9\u0627\u0631 \u0645\u0634\u062a\u0642 \u0627\u0632 \u0622\u0646 \u0637\u0628\u0642 \u062a\u0639\u0631\u06cc\u0641 \u0642\u0627\u0646\u0648\u0646 \u062d\u0641\u0627\u0638\u062a \u0627\u0632 \u062d\u0642\u0648\u0642 \u0645\u0648\u0644\u0641 </span> \
<span dir="ltr" style="font-size: 14pt;">(Copyright Law)</span><span style="font-size: 14pt;" lang="FA"> \
\u0645\u06cc \u0628\u0627\u0634\u062f. \u0627\u06cc\u0646 \u062a\u0639\u0631\u06cc\u0641 \u0639\u0628\u0627\u0631\u062a \u0627\u0633\u062a \u0627\u0632: \u06a9\u0627\u0631\u06cc \u0634\u0627\u0645\u0644 \u0628\u0631\u0646\u0627\u0645\u0647 \u0648 \u06cc\u0627 \u0642\u0633\u0645\u062a\u06cc \u0627\u0632 \u0622\u0646\u060c \u0686\u0647 \u0628\u062f\u0648\u0646 \
\u062a\u063a\u06cc\u06cc\u0631 \u0648 \u06cc\u0627 \u0628\u0627 \u062a\u063a\u06cc\u06cc\u0631 \u0648 \u06cc\u0627 \u062a\u0631\u062c\u0645\u0647 \u0634\u062f\u0647 \u0628\u0647 \u0632\u0628\u0627\u0646\u0647\u0627\u06cc \u062f\u06cc\u06af\u0631 (\u0627\u0632 \u0627\u06cc\u0646 \u067e\u0633 \u06a9\u0644\u0645\u0647 \u062a\u063a\u06cc\u06cc\u0631 \u0628\u062f\u0648\u0646 \
\u0647\u06cc\u0686 \u0645\u062d\u062f\u0648\u062f\u06cc\u062a\u06cc \u0634\u0627\u0645\u0644 \u062a\u0631\u062c\u0645\u0647 \u0646\u06cc\u0632 \u0645\u06cc \u0628\u0627\u0634\u062f.) \u0647\u0631 \u067e\u0631\u0648\u0627\u0646\u0647 \u0628\u0647 \u0646\u0627\u0645 "\u0634\u0645\u0627" \u0635\u0627\u062f\u0631 \u0645\u06cc \u06af\u0631\u062f\u062f.</span><span dir="ltr" style="font-size: 14pt;"><br> \
</span><span style="font-size: 14pt;" lang="FA"><br> \
\u0641\u0639\u0627\u0644\u06cc\u062a\u0647\u0627\u06cc\u06cc \u062c\u062f\u0627\u06cc \u0627\u0632 \u062a\u06a9\u062a\u06cc\u0631\u060c \u062a\u0648\u0632\u06cc\u0639 \u0648 \u062a\u063a\u06cc\u06cc\u0631 \u0634\u0627\u0645\u0644 \u0627\u06cc\u0646 \u067e\u0631\u0648\u0627\u0646\u0647 \u0646\u0645\u06cc \u0634\u0648\u0646\u062f\u061b \u0622\u0646\u0647\u0627 \u062e\u0627\u0631\u062c \u0627\u0632 \
\u062d\u06cc\u0637\u0647 \u0627\u06cc\u0646 \u067e\u0631\u0648\u0627\u0646\u0647 \u0647\u0633\u062a\u0646\u062f. \u0639\u0645\u0644 \u0627\u062c\u0631\u0627\u06cc \u0628\u0631\u0646\u0627\u0645\u0647 \u0634\u0627\u0645\u0644 \u0627\u06cc\u0646 \u067e\u0631\u0648\u0627\u0646\u0647 \u0646\u06cc\u0633\u062a \u0648 \u062e\u0631\u0648\u062c\u06cc \u062d\u0627\u0635\u0644 \u0627\u0632 \u0622\u0646 \
\u0641\u0642\u0637 \u062f\u0631 \u0635\u0648\u0631\u062a\u06cc \u06a9\u0647 \u062d\u0627\u0635\u0644 \u06a9\u0627\u0631\u06cc \u06a9\u0647 \u062f\u0631 \u062f\u0627\u062e\u0644 \u0628\u0631\u0646\u0627\u0645\u0647 \u0634\u062f\u0647 \u0627\u0633\u062a (\u0645\u062c\u0632\u0627\u06cc \u0627\u0632 \u0686\u06cc\u0632\u06cc \u06a9\u0647 \u0628\u0631 \u0627\u0633\u0627\u0633 \
\u0627\u062c\u0631\u0627\u06cc \u0628\u0631\u0646\u0627\u0645\u0647 \u062a\u0648\u0644\u06cc\u062f \u0645\u06cc \u06af\u0631\u062f\u062f) \u0628\u0627\u0634\u062f \u062a\u062d\u062a \u067e\u0648\u0634\u0634 \u0627\u06cc\u0646 \u067e\u0631\u0648\u0627\u0646\u0647 \u0645\u06cc \u0628\u0627\u0634\u062f. \u0635\u062d\u062a \u0627\u06cc\u0646 \u0627\u0645\u0631 \u0628\u0647 \
\u0646\u062d\u0648\u0647 \u0639\u0645\u0644\u06a9\u0631\u062f \u0628\u0631\u0646\u0627\u0645\u0647 \u0628\u0633\u062a\u06af\u06cc \u062f\u0627\u0631\u062f.</span><span dir="ltr" style="font-size: 14pt;"><br> \
<!--[if !supportLineBreakNewLine]--><br> \
&nbsp;<!--[endif]--></span></p> \
<p class="MsoNormal" dir="rtl" style="text-align: right; text-indent: -18pt; direction: rtl; unicode-bidi: embed; margin-right: 36pt;"> \
<span style="font-size: 14pt;">1.<span style="font-style: normal; font-variant: normal; font-weight: normal; font-size: 7pt; font-family: Times New Roman;">&nbsp;&nbsp;&nbsp;&nbsp; \
</span></span><span style="font-size: 14pt;" dir="rtl" lang="FA">\u0634\u0645\u0627 \u0645\u06cc \u062a\u0648\u0627\u0646\u06cc\u062f \
\u0646\u0633\u062e\u0647 \u0647\u0627\u06cc \u062a\u063a\u06cc\u06cc\u0631 \u0646\u06a9\u0631\u062f\u0647 \u06a9\u062f \u0627\u0635\u0644\u06cc \u0628\u0631\u0646\u0627\u0645\u0647 \u0631\u0627 \u0647\u0645\u0627\u0646\u0637\u0648\u0631 \u06a9\u0647 \u0622\u0646 \u0631\u0627 \u062f\u0631\u06cc\u0627\u0641\u062a \u0645\u06cc \u06a9\u0646\u06cc\u062f \u0627\u0632 \u0637\u0631\u06cc\u0642 \
\u0647\u0631 \u0628\u0633\u062a\u0631\u06cc&nbsp; \u062a\u06a9\u062b\u06cc\u0631 \u0648 \u06cc\u0627 \u062a\u0648\u0632\u06cc\u0639 \u06a9\u0646\u06cc\u062f\u060c \u0628\u0647 \u0634\u0631\u0637\u06cc \u06a9\u0647 \u0628\u0637\u0648\u0631 \u0648\u0627\u0636\u062d \u0648 \u0635\u062d\u06cc\u062d \u062f\u0631 \u0647\u0631 \u06a9\u062f\u0627\u0645 \u06cc\u06a9 \u06a9\u067e\u06cc \
\u0627\u0632 \u0627\u0639\u0644\u0627\u0646 \u062d\u0642 \u062a\u0627\u0644\u06cc\u0641 \u0648 \u062d\u062f\u0648\u062f \u0645\u0633\u0648\u0648\u0644\u06cc\u062a \u0631\u0627 \u06af\u0646\u062c\u0627\u0646\u062f\u0647 \u0648 \u062a\u0645\u0627\u0645\u06cc \u0627\u0639\u0644\u0627\u0646\u0647\u0627\u06cc\u06cc \u06a9\u0647 \u0628\u0647 \u0627\u06cc\u0646 \u067e\u0631\u0648\u0627\u0646\u0647 \
\u0627\u0631\u062c\u0627\u0639&nbsp; \u0645\u06cc \u062f\u0647\u0646\u062f \u0631\u0627 \u0628\u0647 \u0647\u0645\u0631\u0627\u0647 \u0627\u0634\u0627\u0631\u0647 \u0628\u0647 \u0639\u062f\u0645 \u0648\u062c\u0648\u062f \u0647\u0631\u06af\u0648\u0646\u0647 \u062a\u0636\u0645\u06cc\u0646\u060c \u062f\u0633\u062a \u0646\u062e\u0648\u0631\u062f\u0647 \u0628\u0627\u0642\u06cc \
\u0628\u06af\u0630\u0627\u0631\u06cc\u062f \u0648 \u0628\u0647 \u0647\u0631 \u062f\u0631\u06cc\u0627\u0641\u062a \u06a9\u0646\u0646\u062f\u0647 \u0628\u0631\u0646\u0627\u0645\u0647 \u06cc\u06a9 \u0646\u0633\u062e\u0647 \u0627\u0632 \u0627\u06cc\u0646 \u067e\u0631\u0648\u0627\u0646\u0647 \u0631\u0627 \u0628\u0647 \u0647\u0645\u0631\u0627\u0647 \u0628\u0631\u0646\u0627\u0645\u0647 \
\u0628\u062f\u0647\u06cc\u062f.</span><span dir="ltr" style="font-size: 14pt;"><br> \
</span><span style="font-size: 14pt;" lang="FA"><br> \
\u0634\u0645\u0627 \u0645\u0645\u06a9\u0646 \u0627\u0633\u062a \u0628\u0631\u0627\u06cc \u0627\u0646\u062c\u0627\u0645 \u0639\u0645\u0644\u06cc\u0627\u062a \u0641\u06cc\u0631\u06cc\u06a9\u06cc \u0627\u0646\u062a\u0642\u0627\u0644 \u06cc\u06a9 \u0646\u0633\u062e\u0647\u060c \u062d\u0642 \u0627\u0644\u0632\u062d\u0645\u0647 \u062f\u0631\u06cc\u0627\u0641\u062a \u0646\u0645\u0648\u062f\u0647 \u0648 \
\u06cc\u0627 \u062d\u062a\u06cc \u062f\u0631 \u0627\u0632\u0627\u06cc \u062f\u0631\u06cc\u0627\u0641\u062a \u067e\u0648\u0644\u06cc \u0627\u0632 \u0637\u0631\u0641 \u062e\u0648\u062f\u062a\u0627\u0646 \u0628\u0631\u0646\u0627\u0645\u0647 \u0631\u0627 \u0636\u0645\u0627\u0646\u062a \u0646\u0645\u0627\u06cc\u06cc\u062f.</span><span dir="ltr" style="font-size: 14pt;"><br> \
<!--[if !supportLineBreakNewLine]--><br> \
&nbsp;<!--[endif]--></span></p> \
<p class="MsoNormal" dir="rtl" style="text-align: right; text-indent: -18pt; direction: rtl; unicode-bidi: embed; margin-right: 36pt;"> \
<span style="font-size: 14pt;">2.<span style="font-style: normal; font-variant: normal; font-weight: normal; font-size: 7pt; font-family: Times New Roman;">&nbsp;&nbsp;&nbsp;&nbsp; \
</span></span><span style="font-size: 14pt;" dir="rtl" lang="FA">\u0634\u0645\u0627 \u0645\u06cc \u062a\u0648\u0627\u0646\u06cc\u062f \
\u0646\u0633\u062e\u0647 \u0647\u0627\u06cc \u062e\u0648\u062f\u062a\u0627\u0646 \u0627\u0632 \u0628\u0631\u0646\u0627\u0645\u0647 - \u0648 \u06cc\u0627 \u0647\u0631 \u062c\u0632\u06cc\u06cc \u0627\u0632 \u0622\u0646 - \u0631\u0627 \u062a\u063a\u06cc\u06cc\u0631 \u062f\u0627\u062f\u0647 \u0648 \u062f\u0631 \u0646\u062a\u06cc\u062c\u0647 \u06a9\u0627\u0631 \
\u062c\u062f\u06cc\u062f\u06cc \u0628\u0631 \u0627\u0633\u0627\u0633 \u0628\u0631\u0646\u0627\u0645\u0647 \u0627\u0648\u0644\u06cc\u0647 \u062a\u0648\u0644\u06cc\u062f \u0646\u0645\u0648\u062f\u0647 \u0648 \u0622\u0646 \u0631\u0627 \u062a\u06a9\u062b\u06cc\u0631 \u0648 \u062a\u0648\u0632\u06cc\u0639 \u0646\u0645\u0627\u06cc\u06cc\u062f \u0628\u0647 \u0634\u0631\u0637\u06cc \u06a9\u0647 \
\u062f\u0631 \u0639\u06cc\u0646 \u067e\u0627\u06cc \u0628\u0646\u062f\u06cc \u0628\u0647 \u0627\u0635\u0648\u0644 \u0628\u0646\u062f (1) \u06a9\u0647 \u062f\u0631 \u0628\u0627\u0644\u0627 \u0622\u0645\u062f \u062a\u0645\u0627\u0645 \u0627\u0635\u0648\u0644 \u0632\u06cc\u0631 \u0631\u0627 \u0631\u0639\u0627\u06cc\u062a \u0646\u0645\u0627\u06cc\u06cc\u062f:</span><span dir="ltr" style="font-size: 14pt;"><br> \
&nbsp;</span></p> \
<p class="MsoNormal" dir="rtl" style="text-align: right; direction: rtl; unicode-bidi: embed; margin-right: 72pt;"> \
<span style="font-size: 14pt;" lang="FA">\u0627\u0644\u0641) \u0634\u0645\u0627 \u0628\u0627\u06cc\u062f \u062f\u0631 \u0641\u0627\u06cc\u0644\u0647\u0627\u06cc \u062a\u063a\u06cc\u06cc\u0631 \u062f\u0627\u062f\u0647 \
\u0634\u062f\u0647 \u0628\u0637\u0648\u0631 \u0648\u0627\u0636\u062d \u0645\u0634\u062e\u0635 \u0646\u0645\u0627\u06cc\u06cc\u062f \u06a9\u0647 \u0634\u0645\u0627 \u0622\u0646\u0647\u0627 \u0631\u0627 \u062a\u063a\u06cc\u06cc\u0631 \u062f\u0627\u062f\u0647 \u0627\u06cc\u062f \u0648 \u062a\u0627\u0631\u06cc\u062e \u062a\u063a\u06cc\u06cc\u0631 \u0631\u0627 \u0646\u06cc\u0632 \u062b\u0628\u062a \
\u0646\u0645\u0627\u06cc\u06cc\u062f.</span><span dir="ltr" style="font-size: 14pt;"><br> \
&nbsp;</span></p> \
<p class="MsoNormal" dir="rtl" style="text-align: right; direction: rtl; unicode-bidi: embed; margin-right: 72pt;"> \
<span style="font-size: 14pt;" lang="FA">\u0628) \u0634\u0645\u0627 \u0628\u0627\u06cc\u062f \u0628\u0637\u0648\u0631 \u0648\u0627\u0636\u062d \u06a9\u0644 \u0647\u0631 \u06a9\u0627\u0631\u06cc \u0631\u0627 \u06a9\u0647 \
\u0628\u0635\u0648\u0631\u062a \u062c\u0632\u0621 \u0648 \u06cc\u0627 \u06a9\u0644 \u0627\u0632 \u0628\u0631\u0646\u0627\u0645\u0647 \u0645\u0634\u062a\u0642 \u0634\u062f\u0647 \u0627\u0633\u062a \u0648 \u0642\u0635\u062f \u0627\u0646\u062a\u0634\u0627\u0631 \u0648 \u06cc\u0627 \u062a\u0648\u0632\u06cc\u0639 \u0622\u0646 \u0631\u0627 \u062f\u0627\u0631\u06cc\u062f \u062a\u062d\u062a \
\u0627\u06cc\u0646 \u067e\u0631\u0648\u0627\u0646\u0647 \u0648 \u0628\u0635\u0648\u0631\u062a \u0631\u0627\u06cc\u06af\u0627\u0646 \u062f\u0631 \u0627\u062e\u062a\u06cc\u0627\u0631 \u0647\u0645\u06af\u0627\u0646 \u0642\u0631\u0627\u0631 \u062f\u0647\u06cc\u062f.</span><span dir="ltr" style="font-size: 14pt;"><br> \
&nbsp;</span></p> \
<p class="MsoNormal" dir="rtl" style="text-align: right; direction: rtl; unicode-bidi: embed; margin-right: 72pt;"> \
<span style="font-size: 14pt;" lang="FA">\u062c) \u062f\u0631 \u0635\u0648\u0631\u062a\u06cc \u06a9\u0647 \u0628\u0631\u0646\u0627\u0645\u0647 \u062a\u063a\u06cc\u06cc\u0631 \u062f\u0627\u062f\u0647 \u0634\u062f\u0647 \
\u062f\u0631 \u062d\u0627\u0644\u062a \u0639\u0627\u062f\u06cc \u0628\u0627 \u06a9\u0627\u0631\u0628\u0631 \u062a\u0639\u0627\u0645\u0644 \u062f\u0627\u0631\u062f \u0645\u06cc \u0628\u0627\u06cc\u0633\u062a \u0647\u0646\u06af\u0627\u0645 \u0627\u062c\u0631\u0627 \u062f\u0631 \u0648\u0636\u0639\u06cc\u062a \u062a\u0639\u0627\u0645\u0644\u06cc \u0628\u0627 \u06a9\u0627\u0631\u0628\u0631 \u06cc\u06a9 \
\u0627\u0639\u0644\u0627\u0646 \u0634\u0627\u0645\u0644 \u067e\u06cc\u0627\u0645 \u062d\u0642 \u062a\u0627\u0644\u06cc\u0641 \u0645\u0631\u062a\u0628\u0637 \u0648 \u062a\u0648\u0636\u06cc\u062d\u06cc \u062f\u0631 \u0628\u0627\u0631\u0647 \u0639\u062f\u0645 \u0648\u062c\u0648\u062f \u0647\u0631\u06af\u0648\u0646\u0647 \u062a\u0636\u0645\u06cc\u0646 \u0628\u0631\u0627\u06cc \u0627\u06cc\u0646 \
\u0628\u0631\u0646\u0627\u0645\u0647 (\u0648 \u06cc\u0627 \u0627\u06af\u0631 \u062e\u0648\u062f \u0634\u0645\u0627 \u062a\u0636\u0645\u06cc\u0646\u06cc \u0627\u0631\u0627\u06cc\u0647 \u0645\u06cc \u062f\u0647\u06cc\u062f\u060c \u0622\u0646 \u062a\u0636\u0645\u06cc\u0646) \u0648 \u0647\u0645\u0686\u0646\u06cc\u0646 \u0627\u0645\u06a9\u0627\u0646 \u062a\u0648\u0632\u06cc\u0639 \u0648 \
\u062a\u06a9\u062b\u06cc\u0631 \u0628\u0631\u0646\u0627\u0645\u0647 \u062f\u0631 \u0635\u0648\u0631\u062a \u0631\u0639\u0627\u06cc\u062a \u0642\u0648\u0627\u0646\u06cc\u0646 \u0627\u06cc\u0646 \u067e\u0631\u0648\u0627\u0646\u0647 \u062a\u0648\u0633\u0637 \u06a9\u0627\u0631\u0628\u0631 \u0648 \u0647\u0645\u0686\u0646\u06cc\u0646 \u0646\u062d\u0648\u0647 \u062f\u0633\u062a \u06cc\u0627\u0628\u06cc \
\u06a9\u0627\u0631\u0628\u0631 \u0628\u0647 \u0627\u06cc\u0646 \u0642\u0648\u0627\u0646\u06cc\u0646 \u0631\u0627 \u0646\u0645\u0627\u06cc\u0634 \u062f\u0647\u062f. (\u0627\u0633\u062a\u062b\u0646\u0627: \u0627\u06af\u0631 \u0628\u0631\u0646\u0627\u0645\u0647 \u0627\u0635\u0644\u06cc \u062e\u0648\u062f \u062a\u0639\u0627\u0645\u0644\u06cc \u0627\u0633\u062a \u0627\u0645\u0627 \
\u0686\u0646\u06cc\u0646 \u067e\u06cc\u0627\u0645\u06cc \u0646\u0645\u0627\u06cc\u0634 \u0646\u0645\u06cc \u062f\u0647\u062f \u0634\u0645\u0627 \u0647\u0645 \u0645\u062c\u0628\u0648\u0631 \u0628\u0647 \u0646\u0645\u0627\u06cc\u0634 \u0627\u06cc\u0646 \u067e\u06cc\u0627\u0645 \u0646\u06cc\u0633\u062a\u06cc\u062f.)<br> \
&nbsp;</span></p> \
<p class="MsoNormal" dir="rtl" style="text-align: right; direction: rtl; unicode-bidi: embed; margin-right: 36pt;"> \
<span style="font-size: 14pt;" lang="FA">\u0627\u06cc\u0646 \u0627\u0644\u0632\u0627\u0645\u0627\u062a \u0634\u0627\u0645\u0644 \u06a9\u0644 \u06a9\u0627\u0631 \u062a\u063a\u06cc\u06cc\u0631 \u06cc\u0627\u0641\u062a\u0647 \u0645\u06cc \
\u0634\u0648\u0646\u062f. \u0627\u06af\u0631 \u0642\u0633\u0645\u062a\u0647\u0627\u06cc \u0642\u0627\u0628\u0644 \u062c\u062f\u0627\u0633\u0627\u0632\u06cc \u0627\u0632 \u06a9\u0627\u0631 \u0627\u0632 \u0628\u0631\u0646\u0627\u0645\u0647 \u0645\u0634\u062a\u0642 \u0646\u0634\u062f\u0647 \u0628\u0627\u0634\u0646\u062f\u060c \u0648 \u0645\u0646\u0637\u0642\u0627" \u06a9\u0627\u0631\u0647\u0627\u06cc \
\u062c\u062f\u0627 \u0648 \u0645\u0633\u062a\u0642\u0644 \u0645\u062d\u0633\u0648\u0628 \u0634\u0648\u0646\u062f \u0622\u0646\u06af\u0627\u0647 \u0627\u06cc\u0646 \u067e\u0631\u0648\u0627\u0646\u0647 \u0648 \u0642\u0648\u0627\u0646\u06cc\u0646\u0634 \u0634\u0627\u0645\u0644 \u0622\u0646 \u06a9\u0627\u0631\u0647\u0627\u06cc \u0645\u0633\u062a\u0642\u0644 \u06a9\u0647 \u0628\u0635\u0648\u0631\u062a \
\u06a9\u0627\u0631 \u062c\u062f\u0627 \u062a\u0648\u0632\u06cc\u0639 \u0645\u06cc \u06a9\u0646\u06cc\u062f \u0646\u0645\u06cc \u0634\u0648\u062f \u0648\u0644\u06cc \u0648\u0642\u062a\u06cc \u0622\u0646\u0647\u0627 \u0631\u0627 \u0628\u0647 \u0639\u0646\u0648\u0627\u0646 \u0642\u0633\u0645\u062a\u0647\u0627\u06cc\u06cc \u0627\u0632 \u06cc\u06a9 \u06a9\u0644\u060c \u0628\u0631 \
\u0627\u0633\u0627\u0633 \u0628\u0631\u0646\u0627\u0645\u0647\u060c \u062a\u0648\u0632\u06cc\u0639 \u0645\u06cc \u06a9\u0646\u06cc\u062f \u06a9\u0644 \u062a\u0648\u0632\u06cc\u0639&nbsp; \u0645\u06cc \u0628\u0627\u06cc\u0633\u062a \u0628\u0631 \u0627\u0633\u0627\u0633 \u0642\u0648\u0627\u0646\u06cc\u0646 \u0627\u06cc\u0646 \u067e\u0631\u0648\u0627\u0646\u0647 \u0628\u0627\u0634\u062f \u06a9\u0647 \
\u06a9\u0644 \u06a9\u0627\u0631 \u0634\u0627\u0645\u0644 \u062a\u0645\u0627\u0645 \u0642\u0633\u0645\u062a\u0647\u0627\u06cc&nbsp; \u0645\u062e\u062a\u0644\u0641 \u0622\u0646 \u0631\u0627&nbsp; \u0628\u062f\u0648\u0646 \u062f\u0631 \u0646\u0638\u0631 \u06af\u0631\u0641\u062a\u0646 \u0627\u06cc\u0646\u06a9\u0647 \u0645\u0648\u0644\u0641 \u0622\u0646 \u0642\u0633\u0645\u062a \
\u06a9\u06cc\u0633\u062a\u060c \u062f\u0631 \u0628\u0631 \u062e\u0648\u0627\u0647\u062f \u06af\u0631\u0641\u062a. </span></p> \
<p class="MsoNormal" dir="rtl" style="text-align: right; direction: rtl; unicode-bidi: embed; margin-right: 36pt;"> \
<span style="font-size: 14pt;" lang="FA">\u0628\u0647 \u0627\u06cc\u0646 \u062a\u0631\u062a\u06cc\u0628 \u0642\u0635\u062f \u0627\u06cc\u0646 \u0642\u0633\u0645\u062a \u0627\u062f\u0639\u0627\u06cc \u0645\u0627\u0644\u06a9\u06cc\u062a \
\u0648 \u06cc\u0627 \u062c\u062f\u0644 \u0628\u0631 \u0633\u0631 \u062d\u0642\u0648\u0642 \u0634\u0645\u0627 \u0628\u0631\u0627\u06cc \u06a9\u0627\u0631\u0647\u0627\u06cc\u06cc \u06a9\u0647 \u06a9\u0644 \u0622\u0646 \u0631\u0627 \u0634\u0645\u0627 \u0646\u0648\u0634\u062a\u0647 \u0627\u06cc\u062f \u0646\u06cc\u0633\u062a\u060c \u0628\u0644\u06a9\u0647 \u0647\u062f\u0641 \
\u062f\u0627\u0634\u062a\u0646 \u062d\u0642 \u06a9\u0646\u062a\u0631\u0644 \u062a\u0648\u0632\u06cc\u0639 \u06a9\u0627\u0631\u0647\u0627\u06cc \u0645\u0634\u062a\u0642 \u0634\u062f\u0647 \u0648 \u06cc\u0627 \u06a9\u0627\u0631\u0647\u0627\u06cc \u0627\u0634\u062a\u0631\u0627\u06a9\u06cc \u0628\u0631 \u0627\u0633\u0627\u0633 \u0628\u0631\u0646\u0627\u0645\u0647 \u0645\u06cc \u0628\u0627\u0634\u062f.</span></p> \
<p class="MsoNormal" dir="rtl" style="text-align: right; direction: rtl; unicode-bidi: embed; margin-right: 36pt;"> \
<span style="font-size: 14pt;" lang="FA">\u0628\u0647 \u0639\u0644\u0627\u0648\u0647 \u0648\u062c\u0648\u062f \u0645\u062d\u0636 \u06a9\u0627\u0631 \u062f\u06cc\u06af\u0631\u06cc \u06a9\u0647 \u0628\u0631 \u0627\u0633\u0627\u0633 \
\u0628\u0631\u0646\u0627\u0645\u0647 (\u0648 \u06cc\u0627 \u06a9\u0627\u0631\u06cc \u0628\u0631 \u0627\u0633\u0627\u0633 \u0628\u0631\u0646\u0627\u0645\u0647) &nbsp;\u0646\u06cc\u0633\u062a \u0631\u0648\u06cc \u0647\u0645\u0627\u0646 \u0628\u0633\u062a\u0631 \u062a\u0648\u0632\u06cc\u0639 \u0628\u0631\u0646\u0627\u0645\u0647 \u062f\u0644\u06cc\u0644\u06cc \u0628\u0631\u0627\u06cc \
\u067e\u0648\u0634\u06cc\u062f\u0647 \u0634\u062f\u0646 \u0622\u0646 \u06a9\u0627\u0631 \u062a\u0648\u0633\u0637 \u0627\u06cc\u0646 \u067e\u0631\u0648\u0627\u0646\u0647 \u0646\u0645\u06cc \u0634\u0648\u062f.</span></p> \
<p class="MsoNormal" dir="rtl" style="text-align: right; direction: rtl; unicode-bidi: embed; margin-right: 72pt;"> \
<span style="font-size: 14pt;" lang="FA">&nbsp;</span></p> \
<p class="MsoNormal" dir="rtl" style="text-align: right; text-indent: -18pt; direction: rtl; unicode-bidi: embed; margin-right: 36pt;"> \
<span style="font-size: 14pt;">3.<span style="font-style: normal; font-variant: normal; font-weight: normal; font-size: 7pt; font-family: Times New Roman;">&nbsp;&nbsp;&nbsp;&nbsp; \
</span></span><span style="font-size: 14pt;" dir="rtl" lang="FA">\u0634\u0645\u0627 \u0645\u06cc \u062a\u0648\u0627\u0646\u06cc\u062f \
\u0628\u0631\u0646\u0627\u0645\u0647 \u0631\u0627 \u0628\u0635\u0648\u0631\u062a \u06a9\u062f \u0627\u062c\u0631\u0627\u06cc\u06cc \u0648 \u06cc\u0627 </span><span dir="ltr" style="font-size: 14pt;"> \
Object Code</span><span style="font-size: 14pt;" lang="FA"> \u062a\u06a9\u062b\u06cc\u0631 \u0648 \u062a\u0648\u0632\u06cc\u0639 \u06a9\u0646\u06cc\u062f \
(\u0648 \u06cc\u0627 \u06a9\u0627\u0631\u06cc \u06a9\u0647 \u0628\u0631 \u0627\u0633\u0627\u0633 \u0622\u0646 \u0635\u0648\u0631\u062a \u06af\u0631\u0641\u062a\u0647\u061b \u0637\u06cc \u062a\u0639\u0631\u06cc\u0641 \u0628\u0646\u062f 2) \u0628\u0647 \u0634\u0631\u0637\u06cc \u06a9\u0647 \u0628\u0646\u062f\u0647\u0627\u06cc (1) \u0648 (2) \
\u0631\u0627 \u0631\u0639\u0627\u06cc\u062a \u0646\u0645\u0648\u062f\u0647 \u0648 \u06cc\u06a9\u06cc \u0627\u0632 \u06a9\u0627\u0631\u0647\u0627\u06cc \u0632\u06cc\u0631 \u0631\u0627 \u0646\u06cc\u0632 \u0627\u0646\u062c\u0627\u0645 \u062f\u0647\u06cc\u062f:</span><span dir="ltr" style="font-size: 14pt;"><br> \
&nbsp;</span></p> \
<p class="MsoNormal" dir="rtl" style="text-align: right; direction: rtl; unicode-bidi: embed; margin-right: 72pt;"> \
<span style="font-size: 14pt;" lang="FA">\u0627\u0644\u0641) \u0628\u0647 \u0647\u0645\u0631\u0627\u0647 \u0622\u0646 \u06a9\u062f \u0627\u0635\u0644\u06cc \u0628\u0631\u0646\u0627\u0645\u0647 \u0631\u0627 \
\u0646\u06cc\u0632\u060c \u0628\u0647 \u0635\u0648\u0631\u062a \u062e\u0648\u0627\u0646\u0627 \u0628\u0631\u0627\u06cc \u0645\u0627\u0634\u06cc\u0646 \u0627\u0644\u062d\u0627\u0642 \u0646\u0645\u0627\u06cc\u06cc\u062f \u06a9\u0647 \u062e\u0648\u062f \u0645\u06cc \u0628\u0627\u06cc\u0633\u062a \u062a\u062d\u062a \u0642\u0648\u0627\u0646\u06cc\u0646 \u0628\u0646\u062f\u0647\u0627\u06cc (1) \
\u0648 (2) \u0628\u0627\u0644\u0627 - \u0627\u0632 \u0637\u0631\u06cc\u0642 \u0631\u0648\u0634 \u0634\u0646\u0627\u062e\u062a\u0647 \u0634\u062f\u0647 \u0627\u06cc \u0628\u0631\u0627\u06cc \u06a9\u0627\u0631\u0628\u0631- \u062a\u0648\u0632\u06cc\u0639 \u0634\u0648\u062f \u0648 \u06cc\u0627</span></p> \
<p class="MsoNormal" dir="rtl" style="text-align: right; direction: rtl; unicode-bidi: embed; margin-right: 72pt;"> \
<span style="font-size: 14pt;" lang="FA">\u0628) \u0628\u0647 \u0647\u0645\u0631\u0627\u0647 \u0622\u0646 \u067e\u06cc\u0634\u0646\u0647\u0627\u062f\u06cc\u060c \u0645\u0639\u062a\u0628\u0631 \u0628\u0631\u0627\u06cc 3 \
\u0633\u0627\u0644 \u0627\u0631\u0627\u06cc\u0647 \u0646\u0645\u0627\u06cc\u06cc\u062f \u06a9\u0647 \u0622\u0645\u0627\u062f\u06af\u06cc \u0627\u0631\u0633\u0627\u0644 \u06a9\u062f \u0627\u0635\u0644\u06cc \u0631\u0627 \u0628\u0647 \u0647\u0631 \u0634\u062e\u0635 \u062b\u0627\u0644\u062b\u06cc \u0628\u0647 \u0637\u0648\u0631 \u0631\u0627\u06cc\u06af\u0627\u0646 - \u062c\u062f\u0627\u06cc \
\u0627\u0632 \u0647\u0632\u06cc\u0646\u0647 \u0647\u0627\u06cc \u0634\u0645\u0627 \u0628\u0631\u0627\u06cc \u0627\u0646\u062a\u0642\u0627\u0644 \u0641\u06cc\u0632\u06cc\u06a9\u06cc \u06a9\u062f \u0627\u0635\u0644\u06cc - \u0648 \u0628\u0647 \u0635\u0648\u0631\u062a \u062e\u0648\u0627\u0646\u0627 \u0628\u0631\u0627\u06cc \u0645\u0627\u0634\u06cc\u0646 \u0637\u0628\u0642 \
\u0634\u0631\u0627\u06cc\u0637 \u0628\u0646\u062f\u0647\u0627\u06cc (1) \u0648 (2) \u0628\u0627\u0644\u0627 \u0648 \u0627\u0632 \u0637\u0631\u06cc\u0642 \u0628\u0633\u062a\u0631 \u0645\u0646\u0627\u0633\u0628 \u0627\u0639\u0644\u0627\u0645 \u0646\u0645\u0627\u06cc\u06cc\u062f \u0648 \u06cc\u0627</span></p> \
<p class="MsoNormal" dir="rtl" style="text-align: right; direction: rtl; unicode-bidi: embed; margin-right: 72pt;"> \
<span style="font-size: 14pt;" lang="FA">\u062c) \u0628\u0647 \u0647\u0645\u0631\u0627\u0647 \u0622\u0646 \u0627\u0637\u0644\u0627\u0639\u0627\u062a\u06cc \u0631\u0627 \u06a9\u0647 \u062f\u0631 \u0645\u0648\u0631\u062f \
\u067e\u06cc\u0634\u0646\u0647\u0627\u062f \u062f\u0631\u06cc\u0627\u0641\u062a \u06a9\u062f \u0627\u0635\u0644\u06cc \u0628\u0631\u0646\u0627\u0645\u0647 \u062f\u0631\u06cc\u0627\u0641\u062a \u06a9\u0631\u062f\u0647 \u0627\u06cc\u062f \u0631\u0627 \u0627\u0631\u0633\u0627\u0644 \u0646\u0645\u0627\u06cc\u06cc\u062f (\u0627\u06cc\u0646 \u0631\u0627\u0647 \u062d\u0644 \u0641\u0642\u0637 \
\u0648\u0642\u062a\u06cc \u0645\u062c\u0627\u0632 \u0627\u0633\u062a \u06a9\u0647 \u0634\u0645\u0627 \u0628\u0631\u0646\u0627\u0645\u0647 \u0631\u0627 \u0628\u0647 \u0635\u0648\u0631\u062a \u063a\u06cc\u0631 \u062a\u062c\u0627\u0631\u06cc \u0648 \u062f\u0631 \u0641\u0631\u0645 \u0627\u062c\u0631\u0627\u06cc\u06cc \u0628\u0647 \u0647\u0645\u0631\u0627\u0647 \u0627\u0639\u0644\u0627\u0646\u06cc \
\u0645\u0627\u0646\u0646\u062f \u0622\u0646\u0686\u0647 \u062f\u0631 \u0628\u0646\u062f (\u0628) \u06af\u0641\u062a\u0647 \u0634\u062f \u062f\u0631\u06cc\u0627\u0641\u062a \u062f\u0627\u0634\u062a\u0647 \u0627\u06cc\u062f.)</span></p> \
<p class="MsoNormal" dir="rtl" style="text-align: right; direction: rtl; unicode-bidi: embed; margin-right: 36pt;"> \
<span style="font-size: 14pt;" lang="FA">\u0645\u0646\u0638\u0648\u0631 \u0627\u0632 \u06a9\u062f \u0627\u0635\u0644\u06cc \u06a9\u0627\u0631 \u0641\u0631\u0645 \u0628\u0631\u06af\u0632\u06cc\u062f\u0647 \u0628\u0631\u0627\u06cc \
\u0627\u06cc\u062c\u0627\u062f \u062a\u063a\u06cc\u06cc\u0631\u0627\u062a \u062f\u0631 \u06a9\u0627\u0631 \u0627\u0633\u062a. \u0628\u0631\u0627\u06cc \u06cc\u06a9 \u0628\u0631\u0646\u0627\u0645\u0647 \u0627\u062c\u0631\u0627\u06cc\u06cc \u06a9\u062f \u0627\u0635\u0644\u06cc \u06a9\u0627\u0645\u0644 \u0628\u0647 \u0645\u0639\u0646\u06cc \u062a\u0645\u0627\u0645 \u06a9\u062f\u0647\u0627\u06cc \
\u0628\u0631\u0646\u0627\u0645\u0647 \u0628\u0647 \u0647\u0645\u0631\u0627\u0647 \u06a9\u062f \u0642\u0633\u0645\u062a\u0647\u0627\u06cc \u0645\u062e\u062a\u0644\u0641 \u0622\u0646\u060c \u0628\u0647 \u0639\u0644\u0627\u0648\u0647 \u062a\u0639\u0627\u0631\u06cc\u0641 \u0631\u0627\u0628\u0637\u0647\u0627 </span> \
<span dir="ltr" style="font-size: 14pt;">(Interfaces)</span><span style="font-size: 14pt;" lang="FA">\u060c \
\u0628\u0647 \u0639\u0644\u0627\u0648\u0647 \u06a9\u062f\u0647\u0627\u06cc \u0627\u0633\u062a\u0641\u0627\u062f\u0647 \u0634\u062f\u0647 \u0628\u0631\u0627\u06cc \u06a9\u0646\u062a\u0631\u0644 \u0639\u0645\u0644\u06cc\u0627\u062a \u06a9\u0645\u067e\u0627\u06cc\u0644 \u0634\u062f\u0646 \u0648 \u0646\u0635\u0628 \u0628\u0631\u0646\u0627\u0645\u0647 \u0627\u062c\u0631\u0627\u06cc\u06cc \u0645\u06cc \
\u0628\u0627\u0634\u062f. \u0628\u0647 \u0647\u0631 \u062d\u0627\u0644 \u0628\u0647 \u0639\u0646\u0648\u0627\u0646 \u06cc\u06a9 \u0627\u0633\u062a\u062b\u0646\u0627 \u0644\u0627\u0632\u0645 \u0646\u06cc\u0633\u062a \u06a9\u062f \u0627\u0635\u0644\u06cc \u062a\u0648\u0632\u06cc\u0639 \u0634\u062f\u0647 \u0634\u0627\u0645\u0644 \u0628\u0631\u0646\u0627\u0645\u0647 \u0647\u0627\u06cc\u06cc \
\u0627\u0632 \u062c\u0645\u0644\u0647 \u0633\u06cc\u0633\u062a\u0645 \u0639\u0627\u0645\u0644\u06cc \u06a9\u0647 \u0628\u0631\u0646\u0627\u0645\u0647 \u0631\u0648\u06cc \u0622\u0646 \u0627\u062c\u0631\u0627 \u0645\u06cc \u0634\u0648\u062f \u0648 \u0645\u0644\u062d\u0642\u0627\u062a\u0634 (\u06a9\u0645\u067e\u0627\u06cc\u0644\u0631\u060c \u06a9\u0631\u0646\u0644 \u0648 \
\u063a\u06cc\u0631\u0647) \u06a9\u0647 \u0628\u0637\u0648\u0631 \u0639\u0627\u062f\u06cc \u062a\u0648\u0632\u06cc\u0639 \u0645\u06cc \u0634\u0648\u0646\u062f (\u0686\u0647 \u0628\u0635\u0648\u0631\u062a \u06a9\u062f \u0627\u0635\u0644\u06cc \u0648 \u06cc\u0627 \u0627\u062c\u0631\u0627\u06cc\u06cc) \u0628\u0627\u0634\u062f\u060c \u0645\u06af\u0631 \u0627\u06cc\u0646\u06a9\u0647 \
\u0622\u0646 \u0645\u0644\u062d\u0642\u0627\u062a \u0628\u0647 \u0647\u0645\u0631\u0627\u0647 \u06a9\u062f \u0627\u062c\u0631\u0627\u06cc\u06cc \u0646\u06cc\u0632 \u0628\u0627\u0634\u0646\u062f.</span></p> \
<p class="MsoNormal" dir="rtl" style="text-align: right; direction: rtl; unicode-bidi: embed; margin-right: 36pt;"> \
<span style="font-size: 14pt;" lang="FA">\u0627\u06af\u0631 \u062a\u0648\u0632\u06cc\u0639 \u0646\u0633\u062e\u0647 \u0627\u062c\u0631\u0627\u06cc\u06cc \u0648 \u06cc\u0627 </span> \
<span dir="ltr" style="font-size: 14pt;">Object Code</span><span style="font-size: 14pt;" lang="FA"> \
\u0628\u0631 \u0627\u0633\u0627\u0633 \u067e\u06cc\u0634\u0646\u0647\u0627\u062f \u0628\u0631\u0627\u06cc \u062f\u0631\u06cc\u0627\u0641\u062a \u0622\u0646\u0647\u0627 \u0627\u0632 \u0637\u0631\u06cc\u0642 \u062f\u0633\u062a\u0631\u0633\u06cc \u0628\u0647 \u0645\u0646\u0628\u0639 \u062e\u0627\u0635\u06cc \u0627\u0633\u062a\u060c \u0622\u0646\u06af\u0627\u0647 \u0627\u0631\u0627\u06cc\u0647 \
\u062f\u0633\u062a\u0631\u0633\u06cc \u0645\u0634\u0627\u0628\u0647 \u0628\u0631\u0627\u06cc \u062f\u0631\u06cc\u0627\u0641\u062a \u06a9\u062f \u0627\u0635\u0644\u06cc \u0627\u0632 \u0647\u0645\u0627\u0646 \u0645\u0646\u0628\u0639 \u0628\u0647 \u0639\u0646\u0648\u0627\u0646 \u0627\u06cc\u062c\u0627\u062f \u06a9\u0631\u062f\u0646 \u0627\u0645\u06a9\u0627\u0646 \u062f\u0633\u062a\u0631\u0633\u06cc \
\u0628\u0647 \u06a9\u062f \u0645\u0646\u0628\u0639 \u0645\u062d\u0633\u0648\u0628 \u0645\u06cc \u0634\u0648\u062f\u060c \u062d\u062a\u06cc \u0627\u06af\u0631 \u06a9\u0627\u0631\u0628\u0631\u0627\u0646 \u0645\u062c\u0628\u0648\u0631 \u0628\u0647 \u062f\u0631\u06cc\u0627\u0641\u062a \u06a9\u062f \u0627\u0635\u0644\u06cc \u0628\u0647 \u0647\u0645\u0631\u0627\u0647 \u06a9\u062f \
\u0627\u062c\u0631\u0627\u06cc\u06cc \u0646\u0628\u0627\u0634\u0646\u062f.</span></p> \
<p class="MsoNormal" dir="rtl" style="text-align: right; direction: rtl; unicode-bidi: embed; margin-right: 36pt;">&nbsp;</p> \
<p class="MsoNormal" dir="rtl" style="text-align: right; direction: rtl; unicode-bidi: embed; margin-right: 36pt;"> \
<span style="font-size: 14pt;" lang="FA">4- \u0634\u0645\u0627 \u0646\u0645\u06cc \u062a\u0648\u0627\u0646\u06cc\u062f \u0628\u0631\u0646\u0627\u0645\u0647 \u0631\u0627 \u062a\u06a9\u062b\u06cc\u0631 \
\u06a9\u0646\u06cc\u062f\u060c \u062a\u063a\u06cc\u06cc\u0631 \u062f\u0647\u06cc\u062f\u060c \u062a\u0648\u0632\u06cc\u0639 \u0646\u0645\u0627\u06cc\u06cc\u062f \u0648 \u06cc\u0627 \u0628\u0631\u0627\u06cc \u0627\u0633\u062a\u0641\u0627\u062f\u0647 \u0627\u0632 \u0622\u0646 \u067e\u0631\u0648\u0627\u0646\u0647 \u0627\u06cc \u0635\u0627\u062f\u0631 \u06a9\u0646\u06cc\u062f \u0645\u06af\u0631 \
\u0627\u06cc\u0646\u06a9\u0647 \u0635\u0631\u06cc\u062d\u0627" \u0645\u0637\u0627\u0628\u0642 \u0627\u06cc\u0646 \u067e\u0631\u0648\u0627\u0646\u0647 \u0639\u0645\u0644 \u0646\u0645\u0627\u06cc\u06cc\u062f. \u0647\u0631 \u062a\u0644\u0627\u0634 \u062f\u06cc\u06af\u0631\u06cc \u0628\u0631\u0627\u06cc \u062a\u06a9\u062b\u06cc\u0631\u060c \u062a\u0648\u0632\u06cc\u0639\u060c \u0627\u0631\u0627\u06cc\u0647 \
\u067e\u0631\u0648\u0627\u0646\u0647 \u0648 \u06cc\u0627 \u062a\u063a\u06cc\u06cc\u0631 \u0628\u0631\u0646\u0627\u0645\u0647 \u0627\u0632 \u062f\u0631\u062c\u0647 \u0627\u0639\u062a\u0628\u0627\u0631 \u0633\u0627\u0642\u0637 \u0627\u0633\u062a \u0648 \u0628\u0647 \u0637\u0648\u0631 \u062e\u0648\u062f\u06a9\u0627\u0631 \u0645\u0646\u062c\u0631 \u0628\u0647 \u0641\u0633\u062e \
\u062d\u0642\u0648\u0642 \u0634\u0645\u0627 \u0628\u0647 \u0645\u0648\u062c\u0628 \u0627\u06cc\u0646 \u067e\u0631\u0648\u0627\u0646\u0647 \u062e\u0648\u0627\u0647\u062f \u0634\u062f. \u0628\u0647 \u0647\u0631 \u062a\u0631\u062a\u06cc\u0628\u060c\u0627\u0639\u062a\u0628\u0627\u0631 \u067e\u0631\u0648\u0627\u0646\u0647 \u06af\u06cc\u0631\u0646\u062f\u0647 \u0627\u06cc \u06a9\u0647 \
\u0646\u0633\u062e\u0647 \u0627\u06cc&nbsp; \u0627\u0632 \u0628\u0631\u0646\u0627\u0645\u0647 \u0648 \u06cc\u0627 \u062d\u0642\u0648\u0642\u06cc \u0645\u0637\u0627\u0628\u0642 \u0627\u06cc\u0646 \u067e\u0631\u0648\u0627\u0646\u0647 \u0631\u0627 \u062f\u0631\u06cc\u0627\u0641\u062a \u062f\u0627\u0634\u062a\u0647 \u0627\u0633\u062a \u062a\u0627 \u0648\u0642\u062a\u06cc \u06a9\u0647 \
\u0622\u0646\u0647\u0627 \u0628\u0647 \u0627\u06cc\u0646 \u067e\u0631\u0648\u0627\u0646\u0647 \u067e\u0627\u06cc\u0628\u0646\u062f \u0628\u0627\u0634\u0646\u062f \u0633\u0627\u0642\u0637 \u0646\u062e\u0648\u0627\u0647\u062f \u06af\u0631\u062f\u06cc\u062f.</span></p> \
<p class="MsoNormal" dir="rtl" style="text-align: right; direction: rtl; unicode-bidi: embed; margin-right: 36pt;"> \
<span style="font-size: 14pt;" lang="FA">&nbsp;</span></p> \
<p class="MsoNormal" dir="rtl" style="text-align: right; direction: rtl; unicode-bidi: embed; margin-right: 36pt;"> \
<span style="font-size: 14pt;" lang="FA">5- \u0634\u0645\u0627 \u0645\u062c\u0628\u0648\u0631 \u0646\u06cc\u0633\u062a\u06cc\u062f \u0627\u06cc\u0646 \u067e\u0631\u0648\u0627\u0646\u0647 \u0631\u0627 \u0642\u0628\u0648\u0644 \
\u06a9\u0646\u06cc\u062f\u060c \u0686\u0648\u0646 \u0622\u0646 \u0631\u0627 \u0627\u0645\u0636\u0627 \u0646\u0646\u0645\u0648\u062f\u0647 \u0627\u06cc\u062f. \u0628\u0647 \u0647\u0631 \u062d\u0627\u0644 \u0647\u06cc\u0686 \u0686\u06cc\u0632 \u062f\u06cc\u06af\u0631\u06cc \u0628\u0647 \u0634\u0645\u0627 \u0627\u062c\u0627\u0632\u0647 \u062a\u063a\u06cc\u06cc\u0631 \u06cc\u0627 \
\u062a\u0648\u0632\u06cc\u0639 \u0628\u0631\u0646\u0627\u0645\u0647 \u06cc\u0627 \u06a9\u0627\u0631 \u0645\u0634\u062a\u0642 \u0627\u0632 \u0622\u0646 \u0631\u0627 \u0646\u0645\u06cc \u062f\u0647\u062f. \u062f\u0631 \u0635\u0648\u0631\u062a\u06cc \u06a9\u0647 \u0627\u06cc\u0646 \u067e\u0631\u0648\u0627\u0646\u0647 \u0631\u0627 \u0642\u0628\u0648\u0644 \u0646\u062f\u0627\u0631\u06cc\u062f \
\u0641\u0639\u0627\u0644\u06cc\u062a\u0647\u0627\u06cc \u0646\u0627\u0645\u0628\u0631\u062f\u0647 \u063a\u06cc\u0631 \u0642\u0627\u0646\u0648\u0646\u06cc \u0645\u062d\u0633\u0648\u0628 \u0645\u06cc \u0634\u0648\u0646\u062f. \u0628\u0647 \u0647\u0631 \u062d\u0627\u0644 \u0628\u0627 \u062a\u063a\u06cc\u06cc\u0631 \u06cc\u0627 \u062a\u0648\u0632\u06cc\u0639 \u0628\u0631\u0646\u0627\u0645\u0647 \
(\u06cc\u0627 \u0647\u0631 \u06a9\u0627\u0631\u06cc \u0628\u0631 \u0627\u0633\u0627\u0633 \u0628\u0631\u0646\u0627\u0645\u0647)\u060c \u0634\u0645\u0627 \u067e\u0627\u06cc\u0628\u0646\u062f\u06cc \u0628\u0647 \u0627\u06cc\u0646 \u067e\u0631\u0648\u0627\u0646\u0647 \u0631\u0627 \u0646\u0634\u0627\u0646 \u062f\u0627\u062f\u0647 \u0627\u06cc\u062f \u0648 \u062a\u0645\u0627\u0645\u06cc \
\u0642\u0648\u0627\u0646\u06cc\u0646 \u0648 \u0645\u0642\u0631\u0631\u0627\u062a \u0628\u0631\u0627\u06cc \u062a\u06a9\u062b\u06cc\u0631 \u06cc\u0627 \u062a\u063a\u06cc\u06cc\u0631 \u0628\u0631\u0646\u0627\u0645\u0647 \u06cc\u0627 \u06a9\u0627\u0631\u0647\u0627\u06cc\u06cc \u06a9\u0647 \u0628\u0631 \u0627\u0633\u0627\u0633 \u0622\u0646 \u0627\u0646\u062c\u0627\u0645 \u0634\u062f\u0647 \u0631\u0627 \
\u0642\u0628\u0648\u0644 \u0646\u0645\u0648\u062f\u0647 \u0627\u06cc\u062f.</span></p> \
<p class="MsoNormal" dir="rtl" style="text-align: right; direction: rtl; unicode-bidi: embed; margin-right: 36pt;">&nbsp;</p> \
<p class="MsoNormal" dir="rtl" style="text-align: right; direction: rtl; unicode-bidi: embed; margin-right: 36pt;"> \
<span style="font-size: 14pt;" lang="FA">6- \u0647\u0631 \u062f\u0641\u0639\u0647 \u06a9\u0647 \u0628\u0631\u0646\u0627\u0645\u0647 (\u06cc\u0627 \u06a9\u0627\u0631\u06cc \u0628\u0631 \u0627\u0633\u0627\u0633 \
\u0622\u0646) \u0631\u0627 \u062a\u0648\u0632\u06cc\u0639 \u0645\u06cc \u0646\u0645\u0627\u06cc\u06cc\u062f\u060c \u062f\u0631\u06cc\u0627\u0641\u062a \u06a9\u0646\u0646\u062f\u0647 \u0628\u0647 \u0637\u0648\u0631 \u062e\u0648\u062f\u06a9\u0627\u0631 \u06cc\u06a9 \u067e\u0631\u0648\u0627\u0646\u0647 \u0628\u0631\u0627\u06cc \u06a9\u067e\u06cc\u060c \u062a\u0648\u0632\u06cc\u0639 \u0648 \
\u06cc\u0627 \u062a\u063a\u06cc\u06cc\u0631 \u0628\u0631\u0646\u0627\u0645\u0647 \u0628\u0631 \u0627\u0633\u0627\u0633 \u0627\u06cc\u0646 \u067e\u0631\u0648\u0627\u0646\u0647 \u0631\u0627 \u0627\u0632 \u0635\u0627\u062d\u0628 \u0627\u0635\u0644\u06cc \u062d\u0642 \u0627\u0645\u062a\u06cc\u0627\u0632 \u0628\u0631\u0646\u0627\u0645\u0647 \u062f\u0631\u06cc\u0627\u0641\u062a \u0645\u06cc \
\u0646\u0645\u0627\u06cc\u062f. \u0634\u0645\u0627 \u0627\u0645\u06a9\u0627\u0646 \u0645\u062d\u062f\u0648\u062f \u06a9\u0631\u062f\u0646 \u062d\u0642\u0648\u0642 \u062f\u0631\u06cc\u0627\u0641\u062a \u06a9\u0646\u0646\u062f\u0647\u060c \u06a9\u0647 \u062f\u0631 \u0627\u06cc\u0646 \u067e\u0631\u0648\u0627\u0646\u0647 \u0628\u0647 \u0622\u0646\u0647\u0627 \u0627\u0634\u0627\u0631\u0647 \
\u0634\u062f\u0647 \u0631\u0627\u060c \u0646\u062f\u0627\u0631\u06cc\u062f. \u0634\u0645\u0627 \u0645\u0633\u0648\u0648\u0644 \u0627\u062c\u0628\u0627\u0631 \u062f\u0631\u06cc\u0627\u0641\u062a \u06a9\u0646\u0646\u062f\u06af\u0627\u0646 \u0628\u0647 \u067e\u06cc\u0631\u0648\u06cc \u0627\u0632 \u0627\u06cc\u0646 \u0642\u0648\u0627\u0646\u06cc\u0646 \u0646\u06cc\u0633\u062a\u06cc\u062f.</span></p> \
<p class="MsoNormal" dir="rtl" style="text-align: right; direction: rtl; unicode-bidi: embed; margin-right: 36pt;"> \
<span style="font-size: 14pt;" lang="FA">&nbsp;</span></p> \
<p class="MsoNormal" dir="rtl" style="text-align: right; direction: rtl; unicode-bidi: embed; margin-right: 36pt;"> \
<span style="font-size: 14pt;" lang="FA">7- \u0627\u06af\u0631 \u0628\u0631 \u0627\u0633\u0627\u0633 \u0642\u0636\u0627\u0648\u062a \u062f\u0627\u062f\u06af\u0627\u0647 \u0648 \u06cc\u0627 \u0627\u062f\u0639\u0627\u06cc \
\u0645\u0627\u0644\u06a9\u06cc\u062a \u062d\u0642 \u0627\u0645\u062a\u06cc\u0627\u0632 \u0648 \u06cc\u0627 \u0628\u0647 \u0647\u0631 \u062f\u0644\u06cc\u0644 \u062f\u06cc\u06af\u0631 (\u0646\u0647 \u0641\u0642\u0637 \u062f\u0644\u0627\u06cc\u0644 \u0645\u0631\u062a\u0628\u0637 \u0628\u0627 \u062d\u0642 \u0627\u0645\u062a\u06cc\u0627\u0632) \u0634\u0631\u0627\u06cc\u0637\u06cc \
\u0628\u0631 \u0634\u0645\u0627 \u0627\u0639\u0645\u0627\u0644 \u06af\u0631\u062f\u06cc\u062f ( \u0686\u0647 \u0628\u0631 \u0627\u0633\u0627\u0633 \u062f\u0633\u062a\u0648\u0631 \u062f\u0627\u062f\u06af\u0627\u0647 \u0648 \u06cc\u0627 \u062a\u0648\u0627\u0641\u0642 \u06cc\u0627 \u0628\u0647 \u0647\u0631 \u062f\u0644\u06cc\u0644 \u062f\u06cc\u06af\u0631) \u06a9\u0647 \
\u0645\u0642\u0631\u0631\u0627\u062a \u0627\u06cc\u0646 \u067e\u0631\u0648\u0627\u0646\u0647 \u0631\u0627 \u0646\u0642\u0636 \u0645\u06cc \u06a9\u0631\u062f\u060c \u0622\u0646 \u0634\u0631\u0627\u06cc\u0637 \u062f\u0644\u06cc\u0644\u06cc \u0628\u0631\u0627\u06cc \u0639\u062f\u0645 \u067e\u0627\u06cc\u0628\u0646\u062f\u06cc \u0634\u0645\u0627 \u0628\u0647 \u0627\u06cc\u0646 \
\u067e\u0631\u0648\u0627\u0646\u0647 \u0646\u062e\u0648\u0627\u0647\u0646\u062f \u0628\u0648\u062f. \u0627\u06af\u0631 \u0634\u0645\u0627 \u0646\u062a\u0648\u0627\u0646\u06cc\u062f \u0628\u0631\u0646\u0627\u0645\u0647 \u0631\u0627 \u0628\u0647 \u0646\u062d\u0648\u06cc \u06a9\u0647 \u0628\u0637\u0648\u0631 \u0647\u0645\u0632\u0645\u0627\u0646 \u0628\u0627 \u0645\u0642\u0631\u0631\u0627\u062a \
\u0627\u06cc\u0646 \u067e\u0631\u0648\u0627\u0646\u0647 \u0648 \u062f\u06cc\u06af\u0631 \u0645\u0642\u0631\u0631\u0627\u062a \u062c\u0627\u0631\u06cc \u062d\u0642 \u062a\u0627\u0644\u06cc\u0641 \u0633\u0627\u0632\u06af\u0627\u0631 \u0628\u0627\u0634\u062f \u062a\u0648\u0632\u06cc\u0639 \u0646\u0645\u0627\u06cc\u06cc\u062f \u0645\u06cc \u0628\u0627\u06cc\u0633\u062a \u062f\u0631 \u06a9\u0644 \
\u0627\u0632 \u062a\u0648\u0632\u06cc\u0639 \u0628\u0631\u0646\u0627\u0645\u0647 \u062e\u0648\u062f\u062f\u0627\u0631\u06cc \u0646\u0645\u0627\u06cc\u06cc\u062f. \u0628\u0647 \u0639\u0646\u0648\u0627\u0646 \u0646\u0645\u0648\u0646\u0647\u060c \u0627\u06af\u0631 \u067e\u0631\u0648\u0627\u0646\u0647 \u062d\u0642\u0648\u0642 \u06cc\u06a9 \u0628\u0631\u0646\u0627\u0645\u0647 \u0627\u062c\u0627\u0632\u0647 \
\u062a\u0648\u0632\u06cc\u0639 \u0631\u0627\u06cc\u06af\u0627\u0646 \u0622\u0646 \u0631\u0627 \u062a\u0648\u0633\u0637 \u0647\u0645\u0647 \u06a9\u0633\u0627\u0646\u06cc \u06a9\u0647 \u0628\u0637\u0648\u0631 \u0645\u0633\u062a\u0642\u06cc\u0645 \u0648 \u06cc\u0627 \u063a\u06cc\u0631 \u0645\u0633\u062a\u0642\u06cc\u0645 \u0627\u0632 \u0637\u0631\u06cc\u0642 \u0634\u0645\u0627 \
\u062f\u0631\u06cc\u0627\u0641\u062a\u0634 \u0646\u0645\u0648\u062f\u0647 \u0627\u0646\u062f \u0631\u0627 \u0646\u0645\u06cc \u062f\u0647\u062f\u060c \u062a\u0646\u0647\u0627 \u0631\u0627\u0647 \u0628\u0631\u0627\u06cc \u0633\u0627\u0632\u06af\u0627\u0631 \u0645\u0627\u0646\u062f\u0646 \u0628\u0627 \u0627\u06cc\u0646 \u067e\u0631\u0648\u0627\u0646\u0647 \u0648 \u067e\u0631\u0648\u0627\u0646\u0647 \
\u06cc\u0627\u062f \u0634\u062f\u0647 \u062e\u0648\u062f\u062f\u0627\u0631\u06cc \u0627\u0632 \u062a\u0648\u0632\u06cc\u0639 \u0628\u0631\u0646\u0627\u0645\u0647 \u0627\u0633\u062a.</span></p> \
<p class="MsoNormal" dir="rtl" style="text-align: right; direction: rtl; unicode-bidi: embed; margin-right: 36pt;"> \
<span style="font-size: 14pt;" lang="FA">\u0627\u06af\u0631 \u0628\u0646\u0627 \u0628\u0647 \u0634\u0631\u0627\u06cc\u0637 \u062e\u0627\u0635\u06cc \u0648 \u062f\u0631 \u0645\u0648\u0631\u062f \u062e\u0627\u0635\u06cc \
\u0627\u062c\u0631\u0627\u06cc \u0642\u0633\u0645\u062a\u06cc \u0627\u0632 \u0627\u06cc\u0646 \u0628\u0646\u062f \u0645\u06cc\u0633\u0631 \u0646\u0628\u0648\u062f \u0644\u0627\u0632\u0645 \u0627\u0633\u062a \u062a\u0627 \u062f\u06cc\u062f\u06af\u0627\u0647 \u06a9\u0644\u06cc \u0627\u06cc\u0646 \u0628\u0646\u062f \u062f\u0631 \u0646\u0638\u0631 \u06af\u0631\u0641\u062a\u0647 \u0634\u0648\u062f \
\u0648 \u062f\u0631 \u0636\u0645\u0646 \u06a9\u0644 \u0642\u0633\u0645\u062a \u0628\u0631\u0627\u06cc \u062f\u06cc\u06af\u0631 \u0645\u0648\u0627\u0631\u062f \u0627\u062c\u0631\u0627 \u06af\u0631\u062f\u062f.</span></p> \
<p class="MsoNormal" dir="rtl" style="text-align: right; direction: rtl; unicode-bidi: embed; margin-right: 36pt;"> \
<span style="font-size: 14pt;" lang="FA">\u0647\u062f\u0641 \u0627\u06cc\u0646 \u0628\u0646\u062f \u0648\u0627\u062f\u0627\u0631 \u06a9\u0631\u062f\u0646 \u0634\u0645\u0627 \u0628\u0647 \u062c\u062f\u0644 \u0628\u0627 \
\u062f\u06cc\u06af\u0631 \u062d\u0642\u0648\u0642 \u0645\u0627\u0644\u06a9\u06cc\u062a \u0648 \u06cc\u0627 \u0645\u0634\u0627\u062c\u0631\u0647 \u0628\u0631 \u0633\u0631 \u0627\u0639\u062a\u0628\u0627\u0631 \u0622\u0646\u0647\u0627 \u0646\u06cc\u0633\u062a \u0628\u0644\u06a9\u0647 \u0647\u062f\u0641 \u062d\u0641\u0627\u0638\u062a \u0627\u0632 \u06cc\u06a9\u067e\u0627\u0631\u0686\u06af\u06cc \
\u0633\u06cc\u0633\u062a\u0645 \u062a\u0648\u0632\u06cc\u0639 \u0646\u0631\u0645 \u0627\u0641\u0632\u0627\u0631\u0647\u0627\u06cc \u0622\u0632\u0627\u062f \u0627\u0633\u062a \u06a9\u0647 \u0628\u0627 \u067e\u0631\u062f\u0627\u062e\u062a\u0646 \u0628\u0647 \u067e\u0631\u0648\u0627\u0646\u0647 \u0647\u0627\u06cc \u0647\u0645\u06af\u0627\u0646\u06cc \u0645\u06cc\u0633\u0631 \u0645\u06cc \
\u06af\u0631\u062f\u062f. \u0627\u0641\u0631\u0627\u062f \u0632\u06cc\u0627\u062f\u06cc \u0628\u0627 \u0627\u0645\u06cc\u062f\u0648\u0627\u0631 \u0628\u0648\u062f\u0646 \u0628\u0647 \u0627\u0633\u062a\u0648\u0627\u0631\u06cc \u0627\u06cc\u0646 \u0633\u06cc\u0633\u062a\u0645 \u062e\u062f\u0645\u0627\u062a \u0628\u0633\u06cc\u0627\u0631 \u0627\u0631\u0632\u0634\u0645\u0646\u062f\u06cc \u0628\u0647 \
\u0646\u0631\u0645 \u0627\u0641\u0632\u0627\u0631\u0647\u0627\u06cc \u0622\u0632\u0627\u062f \u0646\u0645\u0648\u062f\u0647 \u0627\u0646\u062f \u0648 \u0627\u06cc\u0646 \u062f\u0631\u062d\u0627\u0644\u06cc \u0627\u0633\u062a \u06a9\u0647 \u0622\u0646\u0647\u0627 \u062f\u0631 \u0627\u0646\u062a\u062e\u0627\u0628 \u067e\u0631\u0648\u0627\u0646\u0647 \u062f\u06cc\u06af\u0631\u06cc \u0628\u0631\u0627\u06cc \
\u062a\u0648\u0632\u06cc\u0639 \u0646\u0631\u0645 \u0627\u0641\u0632\u0627\u0631 \u062e\u0648\u062f \u0622\u0632\u0627\u062f\u0646\u062f.</span></p> \
<p class="MsoNormal" dir="rtl" style="text-align: right; direction: rtl; unicode-bidi: embed; margin-right: 36pt;"> \
<span style="font-size: 14pt;" lang="FA">\u0647\u062f\u0641 \u0627\u06cc\u0646 \u0628\u0646\u062f \u0631\u0648\u0634\u0646 \u06a9\u0631\u062f\u0646 \u0686\u06cc\u0632\u06cc \u0627\u0633\u062a \u06a9\u0647 \
\u0645\u0639\u062a\u0642\u062f\u06cc\u0645 \u0646\u062a\u06cc\u062c\u0647 \u0639\u0645\u0644\u06cc \u0634\u062f\u0646 \u0637\u0631\u0632 \u0641\u06a9\u0631 \u062d\u0627\u06a9\u0645 \u0628\u0631 \u0627\u06cc\u0646 \u067e\u0631\u0648\u0627\u0646\u0647 \u0627\u0633\u062a.</span></p> \
<p class="MsoNormal" dir="rtl" style="text-align: right; direction: rtl; unicode-bidi: embed; margin-right: 36pt;">&nbsp;</p> \
<p class="MsoNormal" dir="rtl" style="text-align: right; direction: rtl; unicode-bidi: embed; margin-right: 36pt;"> \
<span style="font-size: 14pt;" lang="FA">8- \u0627\u06af\u0631 \u062a\u0648\u0632\u06cc\u0639 \u0648 \u06cc\u0627 \u0627\u0633\u062a\u0641\u0627\u062f\u0647 \u0627\u0632 \u0628\u0631\u0646\u0627\u0645\u0647 \u0628\u0647 \
\u062f\u0644\u06cc\u0644 \u0648\u062c\u0648\u062f \u0642\u0648\u0627\u0646\u06cc\u0646 \u062e\u0627\u0635 \u0645\u0627\u0644\u06a9\u06cc\u062a \u0645\u062d\u062f\u0648\u062f \u0628\u0647 \u06a9\u0634\u0648\u0631\u0647\u0627\u06cc \u062e\u0627\u0635\u06cc \u0645\u06cc \u0634\u0648\u062f \u0635\u0627\u062d\u0628 \u0627\u0635\u0644\u06cc \u062d\u0642 \u0627\u0645\u062a\u06cc\u0627\u0632 \
\u0628\u0631\u0627\u06cc \u062a\u0648\u0632\u06cc\u0639 \u0645\u0637\u0627\u0628\u0642 \u0627\u06cc\u0646 \u067e\u0631\u0648\u0627\u0646\u0647 \u0645\u06cc \u0628\u0627\u06cc\u0633\u062a \u0645\u062d\u062f\u0648\u062f\u0647 \u062c\u063a\u0631\u0627\u0641\u06cc\u0627\u06cc\u06cc \u062e\u0627\u0635\u06cc \u0631\u0627 \u0628\u0631\u0627\u06cc \u062a\u0648\u0632\u06cc\u0639 \u0628\u0631\u0646\u0627\u0645\u0647 \
\u0645\u0634\u062e\u0635 \u0646\u0645\u0648\u062f\u0647 \u0648 \u0633\u06cc\u0633\u062a\u0645 \u0647\u0627\u06cc \u0644\u0627\u0632\u0645 \u0628\u0631\u0627\u06cc \u062a\u0648\u0632\u06cc\u0639 \u0628\u0631\u0646\u0627\u0645\u0647 \u0641\u0642\u0637 \u062f\u0631 \u0622\u0646 \u0645\u062d\u062f\u0648\u062f\u0647 \u0631\u0627 \u0641\u0631\u0627\u0647\u0645 \u0646\u0645\u0627\u06cc\u062f\u061b \
\u062f\u0631 \u0646\u062a\u06cc\u062c\u0647 \u062a\u0648\u0632\u06cc\u0639 \u0641\u0642\u0637 \u062f\u0631 \u06a9\u0634\u0648\u0631\u0647\u0627\u06cc\u06cc \u0627\u0645\u06a9\u0627\u0646 \u067e\u0630\u06cc\u0631 \u0627\u0633\u062a \u06a9\u0647 \u0645\u062c\u0627\u0632 \u0628\u0647 \u062f\u0631\u06cc\u0627\u0641\u062a \u0628\u0631\u0646\u0627\u0645\u0647 \u0647\u0633\u062a\u0646\u062f \u0648 \
\u0646\u0647 \u062f\u06cc\u06af\u0631 \u06a9\u0634\u0648\u0631\u0647\u0627\u060c \u062f\u0631 \u0627\u06cc\u0646 \u0635\u0648\u0631\u062a \u0644\u0627\u0632\u0645 \u0627\u0633\u062a \u062a\u0627 \u067e\u0631\u0648\u0627\u0646\u0647 \u0628\u0635\u0648\u0631\u062a \u0645\u06a9\u062a\u0648\u0628 \u0645\u062d\u062a\u0648\u06cc \u0627\u06cc\u0646 \u0645\u062d\u062f\u0648\u062f\u06cc\u062a\u0647\u0627 \
\u0646\u06cc\u0632 \u06af\u0631\u062f\u062f.</span></p> \
<p class="MsoNormal" dir="rtl" style="text-align: right; direction: rtl; unicode-bidi: embed; margin-right: 36pt;"> \
<span style="font-size: 14pt;" lang="FA">&nbsp;</span></p> \
<p class="MsoNormal" dir="rtl" style="text-align: right; direction: rtl; unicode-bidi: embed; margin-right: 36pt;"> \
<span style="font-size: 14pt;" lang="FA">9- \u0628\u0646\u06cc\u0627\u062f \u0646\u0631\u0645 \u0627\u0641\u0632\u0627\u0631\u0647\u0627\u06cc \u0622\u0632\u0627\u062f \u0645\u0645\u06a9\u0646 \u0627\u0633\u062a \
\u06af\u0627\u0647 \u06af\u0627\u0647 \u0627\u06cc\u0646 \u067e\u0631\u0648\u0627\u0646\u0647 \u0631\u0627 \u0628\u0627\u0632 \u0628\u06cc\u0646\u06cc \u0646\u0645\u0648\u062f\u0647 \u0648 \u06cc\u0627 \u0646\u0633\u062e\u0647 \u0647\u0627\u06cc \u062c\u062f\u06cc\u062f\u06cc \u0627\u0632 \u0622\u0646 \u0631\u0627 \u0627\u0631\u0627\u06cc\u0647 \u0646\u0645\u0627\u06cc\u062f. \
\u0627\u06cc\u0646 \u0646\u0633\u062e\u0647 \u0647\u0627 \u062f\u0631 \u062f\u06cc\u062f \u06a9\u0644\u06cc \u0645\u0634\u0627\u0628\u0647 \u0647\u0645\u06cc\u0646 \u067e\u0631\u0648\u0627\u0646\u0647 \u062e\u0648\u0627\u0647\u062f \u0628\u0648\u062f \u0648\u0644\u06cc \u0645\u0645\u06a9\u0646 \u0627\u0633\u062a \u062a\u063a\u06cc\u06cc\u0631\u0627\u062a\u06cc \u0628\u0631\u0627\u06cc \
\u0647\u0645\u062e\u0648\u0627\u0646\u06cc \u0622\u0646\u0647\u0627 \u0628\u0631\u0627\u06cc \u062d\u0644 \u0645\u0634\u06a9\u0644\u0627\u062a \u0648 \u0645\u0633\u0627\u06cc\u0644 \u062c\u062f\u06cc\u062f \u0627\u0639\u0645\u0627\u0644 \u06af\u0631\u062f\u062f.</span></p> \
<p class="MsoNormal" dir="rtl" style="text-align: right; direction: rtl; unicode-bidi: embed; margin-right: 36pt;"> \
<span style="font-size: 14pt;" lang="FA">\u0628\u0647 \u0647\u0631 \u0646\u0633\u062e\u0647 \u06cc\u06a9 \u0634\u0645\u0627\u0631\u0647 \u0646\u06af\u0627\u0631\u0634 \u062e\u0627\u0635 \u0627\u062e\u062a\u0635\u0627\u0635 \
\u062e\u0648\u0627\u0647\u062f \u06cc\u0627\u0641\u062a. \u0627\u06af\u0631 \u0628\u0631\u0646\u0627\u0645\u0647 \u0628\u0647 \u06cc\u06a9 \u0646\u0633\u062e\u0647 \u062e\u0627\u0635 \u0648 "\u062a\u0645\u0627\u0645 \u0646\u0633\u062e\u0647 \u0647\u0627\u06cc \u0628\u0639\u062f\u06cc" \u0627\u0634\u0627\u0631\u0647 \u0646\u0645\u0627\u06cc\u062f \u0634\u0645\u0627 \
\u0627\u0645\u06a9\u0627\u0646 \u067e\u06cc\u0631\u0648\u06cc \u0627\u0632 \u0642\u0648\u0627\u0646\u06cc\u0646 \u0648 \u0645\u0642\u0631\u0631\u0627\u062a \u0622\u0646 \u0646\u0633\u062e\u0647 \u062e\u0627\u0635 \u0648 \u06cc\u0627 \u0647\u0631\u06cc\u06a9 \u0627\u0632 \u0646\u0633\u062e\u0647 \u0647\u0627\u06cc \u0628\u0639\u062f\u06cc \u06a9\u0647 \u062a\u0648\u0633\u0637 \
\u0628\u0646\u06cc\u0627\u062f \u0646\u0631\u0645 \u0627\u0641\u0632\u0627\u0631\u0647\u0627\u06cc \u0622\u0632\u0627\u062f \u0645\u0646\u062a\u0634\u0631 \u06af\u0631\u062f\u06cc\u062f\u0647 \u0631\u0627 \u062f\u0627\u0631\u06cc\u062f. \u0627\u06af\u0631 \u0628\u0631\u0646\u0627\u0645\u0647 \u0628\u0647 \u0646\u0633\u062e\u0647 \u062e\u0627\u0635\u06cc \u0627\u0632 \u067e\u0631\u0648\u0627\u0646\u0647 \
\u0627\u0634\u0627\u0631\u0647 \u0646\u0645\u06cc \u06a9\u0646\u062f \u0634\u0645\u0627 \u0645\u062c\u0627\u0632\u06cc\u062f \u0647\u0631 \u0646\u0633\u062e\u0647 \u0627\u06cc \u06a9\u0647 \u062a\u0627 \u06a9\u0646\u0648\u0646 \u062a\u0648\u0633\u0637 \u0628\u0646\u06cc\u0627\u062f \u06cc\u0627\u062f \u0634\u062f\u0647 \u0645\u0646\u062a\u0634\u0631 \u0634\u062f\u0647 \u0631\u0627 \
\u0627\u0646\u062a\u062e\u0627\u0628 \u0646\u0645\u0627\u06cc\u06cc\u062f.</span></p> \
<p class="MsoNormal" dir="rtl" style="text-align: right; direction: rtl; unicode-bidi: embed; margin-right: 36pt;"> \
<span style="font-size: 14pt;" lang="FA">&nbsp;</span></p> \
<p class="MsoNormal" dir="rtl" style="text-align: right; direction: rtl; unicode-bidi: embed; margin-right: 36pt;"> \
<span style="font-size: 14pt;" lang="FA">10- \u0627\u06af\u0631 \u0634\u0645\u0627 \u0645\u06cc \u062e\u0648\u0627\u0647\u06cc\u062f \u0642\u0633\u0645\u062a\u0647\u0627\u06cc\u06cc \u0627\u0632 \
\u0628\u0631\u0646\u0627\u0645\u0647 \u0631\u0627 \u0628\u0627 \u062f\u06cc\u06af\u0631 \u0628\u0631\u0646\u0627\u0645\u0647 \u0647\u0627\u06cc \u0622\u0632\u0627\u062f \u06a9\u0647 \u0642\u0648\u0627\u0646\u06cc\u0646 \u062a\u0648\u0632\u06cc\u0639\u0634\u0627\u0646 \u0645\u062a\u0641\u0627\u0648\u062a \u0627\u0633\u062a \u062a\u0631\u06a9\u06cc\u0628 \u0646\u0645\u0627\u06cc\u06cc\u062f \u0628\u0627 \
\u062a\u0648\u0644\u06cc\u062f \u06a9\u0646\u0646\u062f\u0647 \u062a\u0645\u0627\u0633 \u062d\u0627\u0635\u0644 \u0646\u0645\u0648\u062f\u0647 \u0648 \u0631\u0636\u0627\u06cc\u062a \u0645\u06a9\u062a\u0648\u0628 \u0648\u06cc \u0631\u0627 \u06a9\u0633\u0628 \u0646\u0645\u0627\u06cc\u06cc\u062f. \u0628\u0631\u0627\u06cc \u0646\u0631\u0645 \u0627\u0641\u0632\u0627\u0631\u0647\u0627\u06cc \
\u0628\u0646\u06cc\u0627\u062f \u0646\u0631\u0645 \u0627\u0641\u0632\u0627\u0631\u0647\u0627\u06cc \u0622\u0632\u0627\u062f \u0628\u0647 \u0627\u06cc\u0646 \u0628\u0646\u06cc\u0627\u062f \u0628\u0646\u0648\u06cc\u0633\u06cc\u062f. \u0645\u0627 \u06af\u0627\u0647\u06cc \u0627\u0648\u0642\u0627\u062a \u0627\u0633\u062a\u062b\u0646\u0627\u06cc\u06cc \u0628\u0631\u0627\u06cc \u0627\u06cc\u0646 \
\u0645\u0648\u0636\u0648\u0639 \u0642\u0627\u06cc\u0644 \u0645\u06cc \u0634\u0648\u06cc\u0645\u060c \u062a\u0635\u0645\u06cc\u0645 \u0645\u0627 \u0628\u0631 \u067e\u0627\u06cc\u0647 \u062f\u0648 \u0647\u062f\u0641 \u062d\u0641\u0638 \u0622\u0632\u0627\u062f\u06cc \u062a\u0645\u0627\u0645\u06cc \u0646\u0631\u0645 \u0627\u0641\u0632\u0627\u0631\u0647\u0627\u06cc \u0645\u0634\u062a\u0642 \
\u0634\u062f\u0647 \u0627\u0632 \u0646\u0631\u0645 \u0627\u0641\u0632\u0627\u0631\u0647\u0627\u06cc \u0622\u0632\u0627\u062f \u0645\u0627 \u0648 \u0647\u0645\u0686\u0646\u06cc\u0646 \u0627\u0631\u062a\u0642\u0627 \u0634\u0631\u0627\u06a9\u062a \u0648 \u0627\u0633\u062a\u0641\u0627\u062f\u0647 \u062f\u0648\u0628\u0627\u0631\u0647 \u0627\u0632 \u0646\u0631\u0645 \u0627\u0641\u0632\u0627\u0631 \
\u0628\u0647 \u0637\u0648\u0631 \u0639\u0645\u0648\u0645\u06cc \u062e\u0648\u0627\u0647\u062f \u0628\u0648\u062f.</span></p> \
<p class="MsoNormal" dir="rtl" style="text-align: right; direction: rtl; unicode-bidi: embed; margin-right: 36pt;"> \
<span style="font-size: 14pt;" lang="FA">&nbsp;</span></p> \
<p class="MsoNormal" dir="rtl" style="text-align: right; direction: rtl; unicode-bidi: embed; margin-right: 36pt;"> \
<span style="font-size: 14pt;" lang="FA">\u0628\u062f\u0648\u0646 \u062a\u0639\u0647\u062f</span></p> \
<p class="MsoNormal" dir="rtl" style="text-align: right; direction: rtl; unicode-bidi: embed; margin-right: 36pt;"> \
<span style="font-size: 14pt;" lang="FA">&nbsp;</span></p> \
<p class="MsoNormal" dir="rtl" style="text-align: right; direction: rtl; unicode-bidi: embed; margin-right: 36pt;"> \
<span style="font-size: 14pt;" lang="FA">11- \u0627\u0632 \u0622\u0646\u062c\u0627\u06cc\u06cc\u06a9\u0647 \u0628\u0631\u0627\u06cc \u0628\u0631\u0646\u0627\u0645\u0647 \u0628\u0635\u0648\u0631\u062a \
\u0631\u0627\u06cc\u06af\u0627\u0646 \u067e\u0631\u0648\u0627\u0646\u0647 \u0635\u0627\u062f\u0631 \u0634\u062f\u0647 \u0627\u0633\u062a \u0647\u06cc\u0686 \u062a\u0639\u0647\u062f\u06cc \u0628\u0631\u0627\u06cc \u0628\u0631\u0646\u0627\u0645\u0647 - \u062a\u0627 \u0622\u0646\u062c\u0627 \u06a9\u0647 \u0642\u0648\u0627\u0646\u06cc\u0646 \u062c\u0627\u0631\u06cc \
\u0645\u0648\u062c\u0648\u062f\u0646\u062f - \u0648\u062c\u0648\u062f \u0646\u062f\u0627\u0631\u062f. \u0628\u0631\u0646\u0627\u0645\u0647 "\u0647\u0645\u0627\u0646 \u0627\u0633\u062a \u06a9\u0647 \u0647\u0633\u062a" \u0628\u062f\u0648\u0646 \u0647\u06cc\u0686 \u06af\u0648\u0646\u0647 \u062a\u0639\u0647\u062f\u06cc \u062f\u0631 \u0647\u0631 \u0632\u0645\u06cc\u0646\u0647 \
\u0627\u06cc\u060c \u0686\u0647 \u0628\u0627 \u0628\u0631\u062f\u0627\u0634\u062a \u0634\u0641\u0627\u0647\u06cc \u0648 \u06cc\u0627 \u0636\u0645\u0646\u06cc\u060c \u0686\u0647 \u062a\u062c\u0627\u0631\u06cc \u0648 \u06cc\u0627 \u0633\u0627\u0632\u06af\u0627\u0631\u06cc\u060c \u0645\u06af\u0631 \u0648\u0642\u062a\u06cc \u06a9\u0647 \u062e\u0644\u0627\u0641 \u0627\u06cc\u0646 \
\u0645\u0633\u0627\u0644\u0647 \u062a\u0648\u0633\u0637 \u0635\u0627\u062d\u0628\u0627\u0646 \u0627\u0635\u0644\u06cc \u0648 \u06cc\u0627 \u062a\u0648\u0632\u06cc\u0639 \u06a9\u0646\u0646\u062f\u06af\u0627\u0646 \u062b\u0627\u0644\u062b \u0645\u06a9\u062a\u0648\u0628 \u0634\u062f\u0647 \u0628\u0627\u0634\u062f. \u062a\u0645\u0627\u0645 \u0645\u062e\u0627\u0637\u0631\u0627\u062a \
\u0645\u0631\u062a\u0628\u0637 \u0628\u0627 \u06a9\u06cc\u0641\u06cc\u062a \u0648 \u06a9\u0627\u0631\u0622\u06cc\u06cc \u0628\u0631\u0646\u0627\u0645\u0647 \u062f\u0631 \u0627\u0631\u062a\u0628\u0627\u0637 \u0645\u0633\u062a\u0642\u06cc\u0645 \u0628\u0627 \u0634\u0645\u0627 \u0633\u062a. \u0627\u06af\u0631 \u0628\u0631\u0646\u0627\u0645\u0647 \u062f\u0627\u0631\u0627\u06cc \u0645\u0634\u06a9\u0644 \
\u0628\u0627\u0634\u062f \u0634\u0645\u0627 \u062a\u0645\u0627\u0645 \u0647\u0632\u06cc\u0646\u0647 \u0647\u0627\u06cc \u0646\u06af\u0647\u062f\u0627\u0631\u06cc \u062a\u0639\u0645\u06cc\u0631 \u0648 \u06cc\u0627 \u0627\u0635\u0644\u0627\u062d \u0631\u0627 \u0628\u0631 \u0639\u0647\u062f\u0647 \u062e\u0648\u0627\u0647\u06cc\u062f \u06af\u0631\u0641\u062a.</span></p> \
<p class="MsoNormal" dir="rtl" style="text-align: right; direction: rtl; unicode-bidi: embed; margin-right: 36pt;"> \
<span style="font-size: 14pt;" lang="FA">&nbsp;</span></p> \
<p class="MsoNormal" dir="rtl" style="text-align: right; direction: rtl; unicode-bidi: embed; margin-right: 36pt;"> \
<span style="font-size: 14pt;" lang="FA">12- \u062a\u062d\u062a \u0647\u06cc\u0686 \u0634\u0631\u0627\u06cc\u0637\u06cc\u060c \u0645\u06af\u0631 \u0648\u0642\u062a\u06cc \u06a9\u0647 \u0642\u0627\u0646\u0648\u0646\u06cc \
\u0645\u0642\u0631\u0631 \u06a9\u0631\u062f\u0647 \u0628\u0627\u0634\u062f \u0648 \u06cc\u0627 \u0628\u0631 \u0627\u0633\u0627\u0633 \u0645\u062c\u0648\u0632 \u0645\u06a9\u062a\u0648\u0628 \u0635\u0627\u062d\u0628 \u0627\u0645\u062a\u06cc\u0627\u0632 \u06cc\u0627 \u0647\u0631 \u062a\u0648\u0632\u06cc\u0639 \u06a9\u0646\u0646\u062f\u0647 \u062b\u0627\u0644\u062b \u06a9\u0647 \
\u0628\u0631\u0646\u0627\u0645\u0647 \u0631\u0627 \u062a\u063a\u06cc\u06cc\u0631 \u062f\u0627\u062f\u0647 \u0648 \u06cc\u0627 \u062a\u0648\u0632\u06cc\u0639 \u0645\u06cc \u06a9\u0646\u062f\u060c \u0622\u0646\u0647\u0627 \u0647\u06cc\u0686 \u0645\u0633\u0648\u0648\u0644\u06cc\u062a\u06cc \u062f\u0631 \u0642\u0628\u0627\u0644 \u0647\u0631 \u062e\u0633\u0627\u0631\u062a\u06cc \u0627\u0632 \
\u062c\u0645\u0644\u0647 \u062e\u0633\u0627\u0631\u0627\u062a \u06a9\u0644\u06cc\u060c \u062e\u0627\u0635\u060c \u0648\u0627\u0642\u0639\u0647 \u0648 \u06cc\u0627 \u067e\u06cc \u0622\u0645\u062f\u0647\u0627\u06cc \u0627\u0633\u062a\u0641\u0627\u062f\u0647 \u0648 \u06cc\u0627 \u0639\u062f\u0645 \u0627\u0645\u06a9\u0627\u0646 \u0627\u0633\u062a\u0641\u0627\u062f\u0647 \u0627\u0632 \
\u0628\u0631\u0646\u0627\u0645\u0647 (\u0627\u0632 \u062c\u0645\u0644\u0647 \u0627\u0632 \u062f\u0633\u062a \u0631\u0641\u062a\u0646 \u0627\u0637\u0644\u0627\u0639\u0627\u062a\u060c \u062a\u0648\u0644\u06cc\u062f \u0627\u0637\u0644\u0627\u0639\u0627\u062a \u063a\u0644\u0637 \u0648 \u06cc\u0627 \u0636\u0631\u0631\u0647\u0627\u06cc\u06cc \u0628\u0631\u0627\u06cc \u0634\u0645\u0627 \u0648 \
\u06cc\u0627 \u0627\u0634\u062e\u0627\u0635 \u062b\u0627\u0644\u062b \u0648 \u06cc\u0627 \u0639\u062f\u0645 \u06a9\u0627\u0631\u0622\u06cc\u06cc \u0628\u0631\u0646\u0627\u0645\u0647 \u062f\u0631 \u06a9\u0627\u0631 \u06a9\u0631\u062f\u0646 \u0628\u0627 \u062f\u06cc\u06af\u0631 \u0628\u0631\u0646\u0627\u0645\u0647 \u0647\u0627) \u0631\u0627 &nbsp;\u0646\u062f\u0627\u0631\u0646\u062f \
\u062d\u062a\u06cc \u0627\u06af\u0631 \u0622\u0646\u0647\u0627 \u0628\u0647 \u0627\u062d\u062a\u0645\u0627\u0644 \u0648\u0642\u0648\u0639 \u0627\u06cc\u0646 \u062e\u0633\u0627\u0631\u0627\u062a \u0627\u0634\u0627\u0631\u0647 \u06a9\u0631\u062f\u0647 \u0628\u0627\u0634\u0646\u062f.</span></p> \
<p class="MsoNormal" dir="rtl" style="text-align: right; direction: rtl; unicode-bidi: embed; margin-right: 36pt;"> \
<span style="font-size: 14pt;" lang="FA">&nbsp;</span></p> \
<p class="MsoNormal" dir="rtl" style="text-align: right; direction: rtl; unicode-bidi: embed; margin-right: 36pt;"> \
<span style="font-size: 14pt;" lang="FA">\u067e\u0627\u06cc\u0627\u0646 \u0642\u0648\u0627\u0646\u06cc\u0646 \u0648 \u0645\u0642\u0631\u0631\u0627\u062a</span></p> \
<p class="MsoNormal" dir="rtl" style="text-align: right; direction: rtl; unicode-bidi: embed; margin-right: 36pt;"> \
<span style="font-size: 14pt;" lang="FA">&nbsp;</span></p> \
<p class="MsoNormal" dir="rtl" style="text-align: right; direction: rtl; unicode-bidi: embed;"> \
<span style="font-size: 14pt;" lang="FA">\u0686\u06af\u0648\u0646\u0647 \u0627\u06cc\u0646 \u0642\u0648\u0627\u0646\u06cc\u0646 \u0648 \u0645\u0642\u0631\u0631\u0627\u062a \u0631\u0627 \u062f\u0631\u0628\u0627\u0631\u0647 \
\u0628\u0631\u0646\u0627\u0645\u0647 \u062e\u0648\u062f \u0627\u062c\u0631\u0627 \u0646\u0645\u0627\u06cc\u06cc\u0645</span></p> \
<p class="MsoNormal" dir="rtl" style="text-align: right; direction: rtl; unicode-bidi: embed;"> \
<span style="font-size: 14pt;" lang="FA">&nbsp;</span></p> \
<p class="MsoNormal" dir="rtl" style="text-align: right; direction: rtl; unicode-bidi: embed;"> \
<span style="font-size: 14pt;" lang="FA">\u0627\u06af\u0631 \u0634\u0645\u0627 \u0628\u0631\u0646\u0627\u0645\u0647 \u062c\u062f\u06cc\u062f\u06cc \u0646\u0648\u0634\u062a\u0647 \u0627\u06cc\u062f \u0648 \u0645\u06cc \
\u062e\u0648\u0627\u0647\u06cc\u062f \u0647\u0645\u06af\u0627\u0646 \u062d\u062f\u0627\u06a9\u062b\u0631 \u0628\u0647\u0631\u0647 \u0631\u0627 \u0627\u0632 \u0622\u0646 \u0628\u0628\u0631\u0646\u062f \u0628\u0647\u062a\u0631\u06cc\u0646 \u0631\u0627\u0647 \u062a\u0628\u062f\u06cc\u0644 \u0622\u0646 \u0628\u0647 \u06cc\u06a9 \u0628\u0631\u0646\u0627\u0645\u0647 \u0622\u0632\u0627\u062f \
\u0627\u0633\u062a \u06a9\u0647 \u0647\u0631\u06a9\u0633\u06cc \u0645\u06cc \u062a\u0648\u0627\u0646\u062f \u0645\u0637\u0627\u0628\u0642 \u0645\u0642\u0631\u0631\u0627\u062a\u06cc \u06a9\u0647 \u062f\u0631 \u0628\u0627\u0644\u0627 \u0622\u0645\u062f \u0622\u0646 \u0631\u0627 \u062a\u0648\u0632\u06cc\u0639 \u06a9\u0646\u062f \u0648 \u06cc\u0627 \u062a\u063a\u06cc\u06cc\u0631 \
\u062f\u0647\u062f.</span></p> \
<p class="MsoNormal" dir="rtl" style="text-align: right; direction: rtl; unicode-bidi: embed;"> \
<span style="font-size: 14pt;" lang="FA">\u0628\u0631\u0627\u06cc \u0627\u0646\u062c\u0627\u0645 \u0627\u06cc\u0646 \u06a9\u0627\u0631 \u0627\u06cc\u0646 \u062a\u0648\u0636\u06cc\u062d\u0627\u062a \u0631\u0627 \u0628\u0647 \
\u0628\u0631\u0646\u0627\u0645\u0647 \u0627\u0636\u0627\u0641\u0647 \u0646\u0645\u0627\u06cc\u06cc\u062f. \u0628\u0633\u06cc\u0627\u0631 \u0645\u0637\u0645\u0626\u0646 \u062a\u0631 \u0627\u0633\u062a \u062a\u0627 \u0622\u0646\u0647\u0627 \u0631\u0627 \u0628\u0647 \u0627\u0628\u062a\u062f\u0627\u06cc \u0647\u0631 \u06cc\u06a9 \u0627\u0632 \u06a9\u062f\u0647\u0627\u06cc \u0627\u0635\u0644\u06cc \
\u0627\u0636\u0627\u0641\u0647 \u06a9\u0646\u06cc\u062f\u060c \u0628\u0647 \u062e\u0635\u0648\u0635 \u0628\u0631\u0627\u06cc \u0646\u0645\u0627\u06cc\u0634 \u0627\u0639\u0644\u0627\u0646 \u0639\u062f\u0645 \u0648\u062c\u0648\u062f \u0636\u0645\u0627\u0646\u062a \u0648 \u0647\u0645\u0686\u0646\u06cc\u0646 \u067e\u0631\u0648\u0627\u0646\u0647 \u062d\u0642 \u062a\u0627\u0644\u06cc\u0641 \u0648 \
\u0627\u06cc\u0646\u06a9\u0647 \u06a9\u0644 \u0622\u0646 \u0631\u0627 \u062f\u0631 \u06a9\u062c\u0627 \u0628\u0627\u06cc\u062f \u06cc\u0627\u0641\u062a.</span></p> \
<p class="MsoNormal" dir="rtl" style="text-align: right; direction: rtl; unicode-bidi: embed;"> \
<span style="font-size: 14pt;" lang="FA">&nbsp;</span></p> \
<pre style="margin: 0cm 0cm 0.0001pt; font-size: 10pt; font-family: Courier New; color: black;"><var><span style="font-size: 14pt; font-family: Courier New;">one line to give the program's name and an idea of what it does.</span></var></pre> \
<pre style="margin: 0cm 0cm 0.0001pt; font-size: 10pt; font-family: Courier New; color: black;"><span style="font-size: 14pt;">Copyright (C) <var><span style="font-family: Courier New;">yyyy</span></var>&nbsp; <var><span style="font-family: Courier New;">name of author</span></var></span></pre> \
<pre style="margin: 0cm 0cm 0.0001pt; font-size: 10pt; font-family: Courier New; color: black;"><span style="font-size: 14pt;">&nbsp;</span></pre> \
<pre style="margin: 0cm 0cm 0.0001pt; font-size: 10pt; font-family: Courier New; color: black;"><span style="font-size: 14pt;">This program is free software; you can redistribute it and/or</span></pre> \
<pre style="margin: 0cm 0cm 0.0001pt; font-size: 10pt; font-family: Courier New; color: black;"><span style="font-size: 14pt;">modify it under the terms of the GNU General Public License</span></pre> \
<pre style="margin: 0cm 0cm 0.0001pt; font-size: 10pt; font-family: Courier New; color: black;"><span style="font-size: 14pt;">as published by the Free Software Foundation; either version 2</span></pre> \
<pre style="margin: 0cm 0cm 0.0001pt; font-size: 10pt; font-family: Courier New; color: black;"><span style="font-size: 14pt;">of the License, or (at your option) any later version.</span></pre> \
<pre style="margin: 0cm 0cm 0.0001pt; font-size: 10pt; font-family: Courier New; color: black;"><span style="font-size: 14pt;">&nbsp;</span></pre> \
<pre style="margin: 0cm 0cm 0.0001pt; font-size: 10pt; font-family: Courier New; color: black;"><span style="font-size: 14pt;">This program is distributed in the hope that it will be useful,</span></pre> \
<pre style="margin: 0cm 0cm 0.0001pt; font-size: 10pt; font-family: Courier New; color: black;"><span style="font-size: 14pt;">but WITHOUT ANY WARRANTY; without even the implied warranty of</span></pre> \
<pre style="margin: 0cm 0cm 0.0001pt; font-size: 10pt; font-family: Courier New; color: black;"><span style="font-size: 14pt;">MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.&nbsp; See the</span></pre> \
<pre style="margin: 0cm 0cm 0.0001pt; font-size: 10pt; font-family: Courier New; color: black;"><span style="font-size: 14pt;">GNU General Public License for more details.</span></pre> \
<pre style="margin: 0cm 0cm 0.0001pt; font-size: 10pt; font-family: Courier New; color: black;"><span style="font-size: 14pt;">&nbsp;</span></pre> \
<pre style="margin: 0cm 0cm 0.0001pt; font-size: 10pt; font-family: Courier New; color: black;"><span style="font-size: 14pt;">You should have received a copy of the GNU General Public License</span></pre> \
<pre style="margin: 0cm 0cm 0.0001pt; font-size: 10pt; font-family: Courier New; color: black;"><span style="font-size: 14pt;">along with this program; if not, write to the Free Software</span></pre> \
<pre style="margin: 0cm 0cm 0.0001pt; font-size: 10pt; font-family: Courier New; color: black;"><span style="font-size: 14pt;">Foundation, Inc., 59 Temple Place - Suite 330, Boston, MA&nbsp; 02111-1307, USA.</span></pre> \
<p class="MsoNormal" dir="rtl" style="text-align: right; direction: rtl; unicode-bidi: embed;"> \
<span style="font-size: 14pt;" lang="FA">&nbsp;</span></p> \
<p class="MsoNormal" dir="rtl" style="text-align: right; direction: rtl; unicode-bidi: embed;"> \
<span style="font-size: 14pt;" lang="FA">\u0647\u0645\u0686\u0646\u06cc\u0646 \u0627\u0637\u0644\u0627\u0639\u0627\u062a\u06cc \u062f\u0631\u0628\u0627\u0631\u0647 \u0646\u062d\u0648\u0647 \u062f\u0633\u062a \u06cc\u0627\u0628\u06cc \
\u062f\u06cc\u06af\u0631\u0627\u0646 \u0628\u0647 \u062e\u0648\u062f\u062a\u0627\u0646 \u0631\u0627 \u0627\u0632 \u0637\u0631\u06cc\u0642 \u067e\u0633\u062a \u0627\u0644\u06a9\u062a\u0631\u0648\u0646\u06cc\u06a9 \u0648 \u0645\u0639\u0645\u0648\u0644\u06cc \u0628\u062f\u0647\u06cc\u062f.</span></p> \
<p class="MsoNormal" dir="rtl" style="text-align: right; direction: rtl; unicode-bidi: embed;"> \
<span style="font-size: 14pt;" lang="FA">\u0627\u06af\u0631 \u0628\u0631\u0646\u0627\u0645\u0647 \u0628\u0627 \u06a9\u0627\u0631\u0628\u0631 \u062a\u0639\u0627\u0645\u0644 \u062f\u0627\u0631\u062f \u062e\u0631\u0648\u062c\u06cc \
\u0622\u0646 \u0631\u0627 \u0637\u0648\u0631\u06cc \u0637\u0631\u0627\u062d\u06cc \u06a9\u0646\u06cc\u062f \u06a9\u0647 \u0627\u0639\u0644\u0627\u0646 \u06a9\u0648\u062a\u0627\u0647\u06cc \u0631\u0627\u060c \u0648\u0642\u062a\u06cc \u06a9\u0647 \u0628\u0635\u0648\u0631\u062a \u062a\u0639\u0627\u0645\u0644\u06cc \u0627\u062c\u0631\u0627 \u0645\u06cc \u0634\u0648\u062f\u060c \
\u0646\u0645\u0627\u06cc\u0634 \u062f\u0647\u062f:</span></p> \
<p class="MsoNormal" dir="rtl" style="text-align: right; direction: rtl; unicode-bidi: embed;"> \
<span style="font-size: 14pt;" lang="FA">&nbsp;</span></p> \
<pre style="margin: 0cm 0cm 0.0001pt; font-size: 10pt; font-family: Courier New; color: black;"><span style="font-size: 14pt;">Gnomovision version 69, Copyright (C) <var><span style="font-family: Courier New;">year</span></var> <var><span style="font-family: Courier New;">name of author</span></var></span></pre> \
<pre style="margin: 0cm 0cm 0.0001pt; font-size: 10pt; font-family: Courier New; color: black;"><span style="font-size: 14pt;">Gnomovision comes with ABSOLUTELY NO WARRANTY; for details</span></pre> \
<pre style="margin: 0cm 0cm 0.0001pt; font-size: 10pt; font-family: Courier New; color: black;"><span style="font-size: 14pt;">type `show w'.&nbsp; This is free software, and you are welcome</span></pre> \
<pre style="margin: 0cm 0cm 0.0001pt; font-size: 10pt; font-family: Courier New; color: black;"><span style="font-size: 14pt;">to redistribute it under certain conditions; type `show c' </span></pre> \
<pre style="margin: 0cm 0cm 0.0001pt; font-size: 10pt; font-family: Courier New; color: black;"><span style="font-size: 14pt;">for details.</span></pre> \
<p class="MsoNormal" dir="rtl" style="text-align: right; direction: rtl; unicode-bidi: embed;"> \
<span style="font-size: 14pt;" lang="FA">&nbsp;</span></p> \
<p class="MsoNormal" dir="rtl" style="text-align: right; direction: rtl; unicode-bidi: embed;"> \
<span style="font-size: 14pt;" lang="FA">\u067e\u06cc\u0627\u0645\u0647\u0627\u06cc \u0641\u0631\u0636\u06cc </span> \
<span dir="ltr" style="font-size: 14pt;">\u2018show w\u2019</span><span style="font-size: 14pt;" lang="FA"> \
\u0648 </span><span dir="ltr" style="font-size: 14pt;">\u2018show c\u2019</span><span style="font-size: 14pt;" lang="FA"> \
\u0628\u0627\u06cc\u062f \u0642\u0633\u0645\u062a\u0647\u0627\u06cc \u0645\u0631\u062a\u0628\u0637 \u062f\u0631 \u067e\u0631\u0648\u0627\u0646\u0647 \u0631\u0627 \u0646\u0645\u0627\u06cc\u0634 \u062f\u0647\u062f. \u0648\u0627\u0636\u062d \u0627\u0633\u062a \u06a9\u0647 \u0634\u0645\u0627 \u0645\u0645\u06a9\u0646 \u0627\u0633\u062a \u062f\u0633\u062a\u0648\u0631\u0627\u062a\u06cc \u0628\u0647 \
\u062c\u0632 </span><span dir="ltr" style="font-size: 14pt;">\u2018show c\u2019</span><span style="font-size: 14pt;" lang="FA"> \
\u0648 </span><span dir="ltr" style="font-size: 14pt;">\u2018show w\u2019</span><span style="font-size: 14pt;" lang="FA"> \
\u0631\u0627 \u0628\u06a9\u0627\u0631 \u0628\u0631\u06cc\u062f \u0648 \u06cc\u0627 \u062d\u062a\u06cc \u0645\u0645\u06a9\u0646 \u0627\u0633\u062a \u0622\u0646\u0647\u0627 \u0628\u0627 \u06a9\u0644\u06cc\u06a9 \u0645\u0627\u0648\u0633 \u0648 \u06cc\u0627 \u0627\u0633\u062a\u0641\u0627\u062f\u0647 \u0627\u0632 \u0645\u0646\u0648\u0647\u0627\u06cc \u0628\u0631\u0646\u0627\u0645\u0647 \
\u0646\u0645\u0627\u06cc\u0634 \u06cc\u0627\u0628\u0646\u062f.</span></p> \
<p class="MsoNormal" dir="rtl" style="text-align: right; direction: rtl; unicode-bidi: embed;"> \
<span style="font-size: 14pt;" lang="FA">\u062f\u0631 \u0636\u0645\u0646 \u0627\u06af\u0631 \u0644\u0627\u0632\u0645 \u0627\u0633\u062a \u0645\u06cc \u0628\u0627\u06cc\u0633\u062a \u0627\u0632 \
\u06a9\u0627\u0631\u0641\u0631\u0645\u0627 (\u062f\u0631 \u0635\u0648\u0631\u062a\u06cc \u06a9\u0647 \u0628\u0631\u0646\u0627\u0645\u0647 \u0646\u0648\u06cc\u0633 \u0647\u0633\u062a\u06cc\u062f) \u0648 \u06cc\u0627 \u0645\u062f\u0631\u0633\u0647 \u06cc\u0627 \u062f\u0627\u0646\u0634\u06af\u0627\u0647 \u062e\u0648\u062f (\u062f\u0631 \u0635\u0648\u0631\u062a\u06cc \u06a9\u0647 \
\u0628\u0627 \u0622\u0646\u0647\u0627 \u06a9\u0627\u0631 \u0645\u06cc \u06a9\u0646\u06cc\u062f) \u0628\u062e\u0648\u0627\u0647\u06cc\u062f \u06cc\u06a9 \u0631\u0627\u0641\u0639 \u0645\u0633\u0648\u0648\u0644\u06cc\u062a \u062d\u0642\u0648\u0642 \u0645\u0648\u0644\u0641 \u0631\u0627 \u0628\u0631\u0627\u06cc \u0628\u0631\u0646\u0627\u0645\u0647 \u0627\u0645\u0636\u0627 \
\u0646\u0645\u0627\u06cc\u0646\u062f. \u0646\u0645\u0648\u0646\u0647 \u0627\u06cc \u062f\u0631 \u0632\u06cc\u0631 \u0645\u06cc \u0622\u06cc\u062f:</span></p> \
<p class="MsoNormal" dir="rtl" style="text-align: right; direction: rtl; unicode-bidi: embed;"> \
<span style="font-size: 14pt;" lang="FA">&nbsp;</span></p> \
<pre style="margin: 0cm 0cm 0.0001pt; font-size: 10pt; font-family: Courier New; color: black;"><span style="font-size: 14pt;">Yoyodyne, Inc., hereby disclaims all copyright</span></pre> \
<pre style="margin: 0cm 0cm 0.0001pt; font-size: 10pt; font-family: Courier New; color: black;"><span style="font-size: 14pt;">interest in the program `Gnomovision'</span></pre> \
<pre style="margin: 0cm 0cm 0.0001pt; font-size: 10pt; font-family: Courier New; color: black;"><span style="font-size: 14pt;">(which makes passes at compilers) written </span></pre> \
<pre style="margin: 0cm 0cm 0.0001pt; font-size: 10pt; font-family: Courier New; color: black;"><span style="font-size: 14pt;">by James Hacker.</span></pre> \
<pre style="margin: 0cm 0cm 0.0001pt; font-size: 10pt; font-family: Courier New; color: black;"><span style="font-size: 14pt;">&nbsp;</span></pre> \
<pre style="margin: 0cm 0cm 0.0001pt; font-size: 10pt; font-family: Courier New; color: black;"><var><span style="font-size: 14pt; font-family: Courier New;">signature of Ty Coon</span></var><span style="font-size: 14pt;">, 1 April 1989</span></pre> \
<pre style="margin: 0cm 0cm 0.0001pt; font-size: 10pt; font-family: Courier New; color: black;"><span style="font-size: 14pt;">Ty Coon, President of Vice</span></pre> \
<p class="MsoNormal" dir="rtl" style="text-align: right; direction: rtl; unicode-bidi: embed;"> \
<span style="font-size: 14pt;" lang="FA">&nbsp;</span></p> \
<p class="MsoNormal" dir="rtl" style="text-align: right; direction: rtl; unicode-bidi: embed;"> \
<span style="font-size: 14pt;" lang="FA">(\u0646\u0645\u0648\u0646\u0647 \u0641\u0627\u0631\u0633\u06cc)</span></p> \
<p class="MsoNormal" dir="rtl" style="text-align: right; direction: rtl; unicode-bidi: embed;"> \
<span style="font-size: 14pt;" lang="FA">\u0628\u062f\u06cc\u0646\u0648\u0633\u06cc\u0644\u0647 \u06af\u0648\u0627\u0647\u06cc \u0645\u06cc \u06af\u0631\u062f\u062f \u0634\u0631\u06a9\u062a "\u06a9\u0627\u0631\u0647\u0627\u06cc \
\u0645\u0627" \u0628\u0647 \u0634\u0645\u0627\u0631\u0647 \u062b\u0628\u062a 12345 \u0647\u06cc\u0686 \u06af\u0648\u0646\u0647 \u0627\u062f\u0639\u0627\u06cc\u06cc \u062f\u0631 \u0645\u0648\u0631\u062f \u0645\u0627\u0644\u06a9\u06cc\u062a \u0646\u0631\u0645 \u0627\u0641\u0632\u0627\u0631 "\u0634\u0627\u0647\u06a9\u0627\u0631" \u06a9\u0647 \u0628\u0647 \
\u0645\u0646\u0638\u0648\u0631 \u0633\u0631\u0639\u062a \u0628\u062e\u0634\u06cc\u062f\u0646 \u0628\u0647 \u0645\u062d\u0627\u0633\u0628\u0627\u062a \u0631\u0627\u06cc\u0627\u0646\u0647 \u0627\u06cc \u062a\u0648\u0633\u0637 \u062c\u0646\u0627\u0628 \u0622\u0642\u0627\u06cc "\u0631\u0648\u0632\u0628\u0647 \u0628\u0631\u0646\u0627\u0645\u0647 \u0646\u0648\u06cc\u0633" \u0646\u0648\u0634\u062a\u0647 \
\u0634\u062f\u0647 \u0627\u0633\u062a\u060c \u0646\u062f\u0627\u0631\u062f.</span></p> \
<p class="MsoNormal" dir="rtl" style="text-align: right; direction: rtl; unicode-bidi: embed;"> \
<span style="font-size: 14pt;" lang="FA">\u0646\u0627\u0645 \u0648 \u0627\u0645\u0636\u0627\u06cc \u0645\u062f\u06cc\u0631 \u0639\u0627\u0645\u0644 \u0634\u0631\u06a9\u062a \u06a9\u0627\u0631\u0647\u0627\u06cc \u0645\u0627\u060c<br> \
\u0627\u0648\u0644 \u062e\u0631\u062f\u0627\u062f \u0645\u0627\u0647 1380 \u0634\u0645\u0633\u06cc</span></p> \
<p class="MsoNormal" dir="rtl" style="text-align: right; direction: rtl; unicode-bidi: embed;"> \
<span style="font-size: 14pt;" lang="FA">&nbsp;</span></p> \
<p class="MsoNormal" dir="rtl" style="text-align: right; direction: rtl; unicode-bidi: embed;"> \
<span style="font-size: 14pt;" lang="FA">\u0627\u06cc\u0646 \u067e\u0631\u0648\u0627\u0646\u0647 \u0628\u0647 \u0634\u0645\u0627 \u0627\u062c\u0627\u0632\u0647 \u0646\u0645\u06cc \u062f\u0647\u062f \u062a\u0627 \
\u0628\u0631\u0646\u0627\u0645\u0647 \u062e\u0648\u062f \u0631\u0627 \u0628\u0627 \u0628\u0631\u0646\u0627\u0645\u0647 \u0647\u0627\u06cc \u0627\u0646\u062d\u0635\u0627\u0631\u06cc \u062a\u0631\u06a9\u06cc\u0628 \u0646\u0645\u0627\u06cc\u06cc\u062f. \u0627\u06af\u0631 \u0628\u0631\u0646\u0627\u0645\u0647 \u0634\u0645\u0627 \u06cc\u06a9 \u06a9\u062a\u0627\u0628\u062e\u0627\u0646\u0647 \
\u062a\u0648\u0627\u0628\u0639 \u0627\u0633\u062a \u0645\u0645\u06a9\u0646 \u0627\u0633\u062a \u0642\u0627\u0628\u0644\u06cc\u062a \u0627\u0633\u062a\u0641\u0627\u062f\u0647 \u0628\u0631\u0646\u0627\u0645\u0647 \u0647\u0627\u06cc \u0627\u0646\u062d\u0635\u0627\u0631\u06cc \u0627\u0632 \u0628\u0631\u0646\u0627\u0645\u0647 \u062e\u0648\u062f \u0631\u0627 \u0645\u0641\u06cc\u062f \
\u0628\u0628\u06cc\u0646\u06cc\u062f\u060c \u062f\u0631 \u0627\u06cc\u0646 \u0635\u0648\u0631\u062a \u0627\u0632 "\u067e\u0631\u0648\u0627\u0646\u0647 \u062c\u0627\u0645\u0639 \u0647\u0645\u06af\u0627\u0646\u06cc \u06a9\u0648\u0686\u06a9"(</span><span dir="ltr" style="font-size: 14pt;">Lesser \
General Public License)</span><span style="font-size: 14pt;"> </span> \
<span dir="ltr" style="font-size: 14pt;">GNU</span><span style="font-size: 14pt;" lang="FA"> \
\u0628\u0647 \u062c\u0627\u06cc \u0627\u06cc\u0646 \u067e\u0631\u0648\u0627\u0646\u0647 \u0627\u0633\u062a\u0641\u0627\u062f\u0647 \u06a9\u0646\u06cc\u062f</span><span dir="ltr" style="font-size: 14pt;">.</span></p> \
<p class="MsoNormal" dir="rtl" style="text-align: right; direction: rtl; unicode-bidi: embed; margin-right: 36pt;"> \
<span dir="ltr" style="font-size: 14pt;">&nbsp;</span></p> \
<p class="MsoNormal" dir="rtl" style="text-align: right; direction: rtl; unicode-bidi: embed; margin-right: 18pt;"> \
<span style="font-size: 14pt;" lang="FA">\u067e\u0627\u06cc\u0627\u0646</span><span dir="ltr" style="font-size: 14pt;"> \
-- </span><span style="font-size: 14pt;">&nbsp;</span></p> \
<p class="MsoNormal" dir="rtl" style="text-align: right; direction: rtl; unicode-bidi: embed; margin-right: 18pt;"> \
<span style="font-size: 14pt;" lang="FA">\u0627\u06cc\u0646 \u062a\u0631\u062c\u0645\u0647 \u062f\u0631 \u0645\u0631\u062f\u0627\u062f \u0645\u0627\u0647 \u06cc\u06a9\u0647\u0632\u0627\u0631 \u0648 \u0633\u06cc\u0635\u062f \u0648 \
\u0647\u0634\u062a\u0627\u062f \u0648 \u0633\u0647 \u0634\u0645\u0633\u06cc \u062a\u0648\u0633\u0637 \u06a9\u0627\u0648\u0647 \u0631\u0646\u062c\u0628\u0631 \u0627\u0646\u062c\u0627\u0645 \u0634\u062f\u0647 \u0627\u0633\u062a\u060c \u062e\u0648\u0627\u0647\u0634\u0645\u0646\u062f \u0627\u0633\u062a \u0646\u0638\u0631\u0627\u062a \u0648 \u067e\u06cc\u0634\u0646\u0647\u0627\u062f\u0627\u062a \
\u062e\u0648\u062f \u0631\u0627 \u0628\u0647 \u0622\u062f\u0631\u0633 </span><span dir="ltr" style="font-size: 14pt;">kaveh at kaveh \
period org</span><span style="font-size: 14pt;" lang="FA"> \u0627\u0631\u0633\u0627\u0644 \u0646\u0645\u0627\u06cc\u06cc\u062f.</span></p> \
<p class="MsoNormal" dir="rtl" style="text-align: right; direction: rtl; unicode-bidi: embed; margin-right: 18pt;"> \
<span style="font-size: 14pt;" lang="FA">&nbsp;</span></p> \
<p class="MsoNormal" dir="rtl" style="text-align: left; direction: rtl; unicode-bidi: embed; margin-right: 18pt;" align="right"> \
<span dir="ltr" style="font-size: 14pt;">This translation has been done by \
Kaveh Ranjbar at August 2004, Please send your comments to kaveh at kaveh period \
org .</span></p> \
</body></html>
