# Distribution License:
# JSword is free software; you can redistribute it and/or modify it under
# the terms of the GNU Lesser General Public License, version 2.1 or later
# as published by the Free Software Foundation. This program is distributed
# in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even
# the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# The License is available on the internet at:
#      http://www.gnu.org/copyleft/lgpl.html
# or by writing to:
#      Free Software Foundation, Inc.
#      59 Temple Place - Suite 330
#      Boston, MA 02111-1307, USA
#
# Copyright CrossWire Bible Society, 2005 - 2016
#
BookType\ {0}\ is\ not\ defined\! = \u0E1B\u0E23\u0E30\u0E40\u0E20\u0E17\u0E1E\u0E23\u0E30\u0E18\u0E23\u0E23\u0E21 {0} \u0E44\u0E21\u0E48\u0E44\u0E14\u0E49\u0E16\u0E39\u0E01\u0E01\u0E33\u0E2B\u0E19\u0E14\!
Book\ must\ be\ between\ 1\ and\ 66\ (given\ {0,number,integer}),\ and\ Chapter\ must\ be\ valid\ for\ this\ book\ (given\ {1,number,integer}). = \u0E2B\u0E19\u0E31\u0E07\u0E2A\u0E37\u0E2D\u0E15\u0E49\u0E2D\u0E07\u0E2D\u0E22\u0E39\u0E48\u0E23\u0E30\u0E2B\u0E27\u0E48\u0E32\u0E07 1 \u0E41\u0E25\u0E30 66 \u0E40\u0E25\u0E48\u0E21 (\u0E42\u0E14\u0E22 {0,number,integer}) \u0E41\u0E25\u0E30\u0E1A\u0E17\u0E08\u0E30\u0E15\u0E49\u0E2D\u0E07\u0E16\u0E39\u0E01\u0E15\u0E49\u0E2D\u0E07\u0E2A\u0E33\u0E2B\u0E23\u0E31\u0E1A\u0E1E\u0E23\u0E30\u0E18\u0E23\u0E23\u0E21 (\u0E42\u0E14\u0E22 {1,number,integer}) \u0E19\u0E35\u0E49
Book\ must\ be\ between\ 1\ and\ 66\ (given\ {0,number,integer}). = \u0E2B\u0E19\u0E31\u0E07\u0E2A\u0E37\u0E2D\u0E15\u0E49\u0E2D\u0E07\u0E2D\u0E22\u0E39\u0E48\u0E23\u0E30\u0E2B\u0E27\u0E48\u0E32\u0E07 1 \u0E41\u0E25\u0E30 66 (\u0E42\u0E14\u0E22 {0,number,integer})
Book\ must\ not\ be\ null = \u0E15\u0E49\u0E2D\u0E07\u0E21\u0E35\u0E1E\u0E23\u0E30\u0E18\u0E23\u0E23\u0E21\u0E17\u0E35\u0E48\u0E23\u0E30\u0E1A\u0E38
Can\ only\ use\ Verses\ and\ VerseRanges\ in\ this\ Collection = \u0E2A\u0E32\u0E21\u0E32\u0E23\u0E16\u0E43\u0E0A\u0E49\u0E02\u0E49\u0E2D\u0E1E\u0E23\u0E30\u0E04\u0E31\u0E21\u0E20\u0E35\u0E23\u0E4C\u0E41\u0E25\u0E30\u0E0A\u0E48\u0E27\u0E07\u0E02\u0E49\u0E2D\u0E1E\u0E23\u0E30\u0E04\u0E31\u0E21\u0E20\u0E35\u0E23\u0E4C\u0E43\u0E19\u0E0A\u0E38\u0E14\u0E19\u0E35\u0E49\u0E44\u0E14\u0E49\u0E40\u0E17\u0E48\u0E32\u0E19\u0E31\u0E49\u0E19
Cannot\ alter\ a\ read-only\ key\ list = \u0E44\u0E21\u0E48\u0E2A\u0E32\u0E21\u0E32\u0E23\u0E16\u0E41\u0E01\u0E49\u0E44\u0E02\u0E23\u0E32\u0E22\u0E01\u0E32\u0E23\u0E2D\u0E48\u0E32\u0E19\u0E2D\u0E22\u0E48\u0E32\u0E07\u0E40\u0E14\u0E35\u0E22\u0E27\u0E44\u0E14\u0E49
Cannot\ alter\ a\ read-only\ passage = \u0E44\u0E21\u0E48\u0E2A\u0E32\u0E21\u0E32\u0E23\u0E16\u0E41\u0E01\u0E49\u0E44\u0E02\u0E40\u0E19\u0E37\u0E49\u0E2D\u0E04\u0E27\u0E32\u0E21\u0E17\u0E35\u0E48\u0E2D\u0E48\u0E32\u0E19\u0E2D\u0E22\u0E48\u0E32\u0E07\u0E40\u0E14\u0E35\u0E22\u0E27\u0E44\u0E14\u0E49
Cannot\ find\ resource\:\ {0} = \u0E44\u0E21\u0E48\u0E1E\u0E1A\u0E17\u0E35\u0E48\u0E21\u0E32\: {0}
Class\ {0}\ does\ not\ implement\ {1}. = \u0E2A\u0E48\u0E27\u0E19 {0} \u0E44\u0E21\u0E48\u0E43\u0E0A\u0E49 {1}
Could\ not\ create\ ClassResolver\: = \u0E44\u0E21\u0E48\u0E2A\u0E32\u0E21\u0E32\u0E23\u0E16\u0E2A\u0E23\u0E49\u0E32\u0E07\u0E23\u0E30\u0E14\u0E31\u0E1A\u0E01\u0E32\u0E23\u0E41\u0E01\u0E49\u0E44\u0E02\:
Could\ not\ remove\ unregistered\ Book\:\ {0} = \u0E44\u0E21\u0E48\u0E2A\u0E32\u0E21\u0E32\u0E23\u0E16\u0E25\u0E1A\u0E2B\u0E19\u0E31\u0E07\u0E2A\u0E37\u0E2D\u0E17\u0E35\u0E48\u0E44\u0E21\u0E48\u0E44\u0E14\u0E49\u0E25\u0E07\u0E17\u0E30\u0E40\u0E1A\u0E35\u0E22\u0E19\: {0}
Could\ not\ remove\ unregistered\ Driver\:\ {0} = \u0E44\u0E21\u0E48\u0E2A\u0E32\u0E21\u0E32\u0E23\u0E16\u0E25\u0E1A\u0E44\u0E14\u0E23\u0E40\u0E27\u0E2D\u0E23\u0E4C\u0E17\u0E35\u0E48\u0E44\u0E21\u0E48\u0E44\u0E14\u0E49\u0E25\u0E07\u0E17\u0E30\u0E40\u0E1A\u0E35\u0E22\u0E19\: {0}
DataType\ {0}\ is\ not\ defined\! = \u0E0A\u0E19\u0E34\u0E14\u0E02\u0E2D\u0E07\u0E02\u0E49\u0E2D\u0E21\u0E39\u0E25 {0} \u0E44\u0E21\u0E48\u0E44\u0E14\u0E49\u0E16\u0E39\u0E01\u0E01\u0E33\u0E2B\u0E19\u0E14\!
Error\ loading\ from\ cache = \u0E01\u0E33\u0E25\u0E31\u0E07\u0E42\u0E2B\u0E25\u0E14\u0E02\u0E49\u0E2D\u0E1C\u0E34\u0E14\u0E1E\u0E25\u0E32\u0E14\u0E08\u0E32\u0E01\u0E41\u0E04\u0E0A
Failed\ to\ initialize\ the\ search\ index = \u0E44\u0E21\u0E48\u0E2A\u0E32\u0E21\u0E32\u0E23\u0E16\u0E40\u0E23\u0E34\u0E48\u0E21\u0E15\u0E49\u0E19\u0E14\u0E31\u0E0A\u0E19\u0E35\u0E2A\u0E33\u0E2B\u0E23\u0E31\u0E1A\u0E04\u0E49\u0E19\u0E2B\u0E32\u0E44\u0E14\u0E49
Failed\ to\ parse\ {0} = \u0E44\u0E21\u0E48\u0E2A\u0E32\u0E21\u0E32\u0E23\u0E16\u0E41\u0E22\u0E01 {0} \u0E44\u0E14\u0E49
Failed\ to\ set\ option\:\ {0} = \u0E25\u0E49\u0E21\u0E40\u0E2B\u0E25\u0E27\u0E43\u0E19\u0E01\u0E32\u0E23\u0E15\u0E31\u0E49\u0E07\u0E04\u0E48\u0E32\u0E15\u0E31\u0E27\u0E40\u0E25\u0E37\u0E2D\u0E01\: {0}
Filtering\ input\ data\ failed. = \u0E01\u0E32\u0E23\u0E04\u0E31\u0E14\u0E01\u0E23\u0E2D\u0E07\u0E02\u0E49\u0E2D\u0E21\u0E39\u0E25\u0E25\u0E49\u0E21\u0E40\u0E2B\u0E25\u0E27
Ignoring\ invalid\ option\:\ {0} = \u0E25\u0E30\u0E40\u0E27\u0E49\u0E19\u0E15\u0E31\u0E27\u0E40\u0E25\u0E37\u0E2D\u0E01\u0E17\u0E35\u0E48\u0E44\u0E21\u0E48\u0E16\u0E39\u0E01\u0E15\u0E49\u0E2D\u0E07\: {0}
Index\ out\ of\ range\ (Given\ {0,number,integer},\ Max\ {1,number,integer}). = \u0E14\u0E31\u0E0A\u0E19\u0E35\u0E44\u0E21\u0E48\u0E44\u0E14\u0E49\u0E2D\u0E22\u0E39\u0E48\u0E43\u0E19\u0E0A\u0E48\u0E27\u0E07 (\u0E42\u0E14\u0E22 {0,number,integer}, \u0E21\u0E32\u0E01\u0E17\u0E35\u0E48\u0E2A\u0E38\u0E14 {1,number,integer})
Listener\ {0}\ is\ not\ of\ type\ {1}. = \u0E1C\u0E39\u0E49\u0E1F\u0E31\u0E07 {0} \u0E44\u0E21\u0E48\u0E44\u0E14\u0E49\u0E40\u0E1B\u0E47\u0E19\u0E1B\u0E23\u0E30\u0E40\u0E20\u0E17 {1}
Mismatch\ of\ return\ types,\ found\:\ {0}\ required\:\ {1} = \u0E04\u0E19\u0E25\u0E30\u0E1B\u0E23\u0E30\u0E40\u0E20\u0E17\u0E01\u0E31\u0E19 \u0E1E\u0E1A\: {0} \u0E17\u0E35\u0E48\u0E15\u0E49\u0E2D\u0E07\u0E01\u0E32\u0E23\: {1}
Missing\ data\ files\ for\ old\ and\ new\ testaments\ in\ {0}. = \u0E44\u0E1F\u0E25\u0E4C\u0E02\u0E49\u0E2D\u0E21\u0E39\u0E25\u0E2A\u0E33\u0E2B\u0E23\u0E31\u0E1A\u0E1E\u0E31\u0E19\u0E18\u0E2A\u0E31\u0E0D\u0E0D\u0E32\u0E40\u0E14\u0E34\u0E21\u0E41\u0E25\u0E30\u0E43\u0E2B\u0E21\u0E48\u0E2B\u0E32\u0E22\u0E44\u0E1B {0}
Missing\ {0}\ element\ in\ config.xml = \u0E2D\u0E07\u0E04\u0E4C\u0E1B\u0E23\u0E30\u0E01\u0E2D\u0E1A {0} \u0E43\u0E19 config.xml \u0E44\u0E14\u0E49\u0E2B\u0E32\u0E22\u0E44\u0E1B
Must\ be\ 3\ parts\ to\ the\ reference. = \u0E08\u0E30\u0E15\u0E49\u0E2D\u0E07\u0E21\u0E35 3 \u0E2A\u0E48\u0E27\u0E19\u0E40\u0E1E\u0E37\u0E48\u0E2D\u0E01\u0E32\u0E23\u0E2D\u0E49\u0E32\u0E07\u0E2D\u0E34\u0E07
No\ converter\ called\:\ {0} = \u0E44\u0E21\u0E48\u0E21\u0E35\u0E01\u0E32\u0E23\u0E41\u0E1B\u0E25\u0E07\: {0}
Not\ enough\ /\ symbols\ in\ url\:\ {0} = \u0E44\u0E21\u0E48\u0E1E\u0E2D / \u0E2A\u0E31\u0E0D\u0E25\u0E31\u0E01\u0E29\u0E13\u0E4C\u0E2A\u0E33\u0E2B\u0E23\u0E31\u0E1A\u0E17\u0E35\u0E48\u0E2D\u0E22\u0E39\u0E48\u0E40\u0E27\u0E1A\u0E44\u0E0B\u0E15\u0E4C\: {0}
Ordinal\ must\ be\ between\ 1\ and\ {0,number,integer}\ (given\ {1,number,integer}). = \u0E25\u0E33\u0E14\u0E31\u0E1A\u0E15\u0E49\u0E2D\u0E07\u0E2D\u0E22\u0E39\u0E48\u0E23\u0E30\u0E2B\u0E27\u0E48\u0E32\u0E07 1 \u0E41\u0E25\u0E30 {0,number,integer} (\u0E42\u0E14\u0E22 {1,number,integer})
OsisID\ not\ valid\:\ {0} = OsisID \u0E44\u0E21\u0E48\u0E16\u0E39\u0E01\u0E15\u0E49\u0E2D\u0E07\: {0}
Section\ must\ be\ between\ 1\ and\ 8\ (given\ {0,number,integer}). = \u0E15\u0E49\u0E2D\u0E07\u0E2D\u0E22\u0E39\u0E48\u0E23\u0E30\u0E2B\u0E27\u0E48\u0E32\u0E07 1 \u0E41\u0E25\u0E30 8 (\u0E42\u0E14\u0E22 {0,number,integer})
Specified\ class\ not\ found\:\ {0} = \u0E44\u0E21\u0E48\u0E1E\u0E1A\u0E2A\u0E48\u0E27\u0E19\u0E17\u0E35\u0E48\u0E23\u0E30\u0E1A\u0E38\: {0}
Specified\ method\ not\ found\ {0}.get{1}() = \u0E44\u0E21\u0E48\u0E1E\u0E1A\u0E27\u0E34\u0E18\u0E35\u0E01\u0E32\u0E23\u0E17\u0E35\u0E48\u0E23\u0E30\u0E1A\u0E38 {0} \u0E08\u0E32\u0E01 {1}()
Specified\ method\ not\ found\ {0}.set{1}({2}\ arg0) = \u0E44\u0E21\u0E48\u0E1E\u0E1A\u0E27\u0E34\u0E18\u0E35\u0E01\u0E32\u0E23\u0E17\u0E35\u0E48\u0E23\u0E30\u0E1A\u0E38 {0} \u0E0A\u0E38\u0E14{1}({2} arg0)
The\ URL\ {0}\ does\ not\ end\ in\ {1}. = \u0E17\u0E35\u0E48\u0E2D\u0E22\u0E39\u0E48\u0E40\u0E27\u0E1A\u0E44\u0E0B\u0E15\u0E4C {0} \u0E44\u0E21\u0E48\u0E44\u0E14\u0E49\u0E2A\u0E34\u0E49\u0E19\u0E2A\u0E38\u0E14\u0E17\u0E35\u0E48 {1}
This\ Book\ is\ read-only. = \u0E2B\u0E19\u0E31\u0E07\u0E2A\u0E37\u0E2D\u0E40\u0E25\u0E48\u0E21\u0E19\u0E35\u0E49\u0E40\u0E1B\u0E47\u0E19\u0E41\u0E1A\u0E1A\u0E2D\u0E48\u0E32\u0E19\u0E2D\u0E22\u0E48\u0E32\u0E07\u0E40\u0E14\u0E35\u0E22\u0E27
URL\ manipulation\ failed = \u0E01\u0E32\u0E23\u0E08\u0E31\u0E14\u0E01\u0E32\u0E23\u0E17\u0E35\u0E48\u0E2D\u0E22\u0E39\u0E48\u0E40\u0E27\u0E1A\u0E44\u0E0B\u0E15\u0E4C\u0E44\u0E21\u0E48\u0E16\u0E39\u0E01\u0E15\u0E49\u0E2D\u0E07
Unable\ to\ save\ {0}. = \u0E44\u0E21\u0E48\u0E2A\u0E32\u0E21\u0E32\u0E23\u0E16\u0E1A\u0E31\u0E19\u0E17\u0E36\u0E01 {0}
Unknown\ passage\ type. = \u0E44\u0E21\u0E48\u0E23\u0E39\u0E49\u0E08\u0E31\u0E01
Unsupported\ type\:\ {0}\ when\ reading\ {1} = \u0E44\u0E21\u0E48\u0E2A\u0E19\u0E31\u0E1A\u0E2A\u0E19\u0E38\u0E19\u0E1B\u0E23\u0E30\u0E40\u0E20\u0E17\: {0} \u0E40\u0E21\u0E37\u0E48\u0E2D\u0E2D\u0E48\u0E32\u0E19 {1}
Use\ patch\=true. = Use patch\=true.
Verse\ element\ could\ not\ be\ found = \u0E44\u0E21\u0E48\u0E1E\u0E1A\u0E2D\u0E07\u0E04\u0E4C\u0E1B\u0E23\u0E30\u0E01\u0E2D\u0E1A\u0E02\u0E2D\u0E07\u0E02\u0E49\u0E2D\u0E1E\u0E23\u0E30\u0E04\u0E31\u0E21\u0E20\u0E35\u0E23\u0E4C
nextElement()\ has\ not\ been\ called\ yet. = \u0E2D\u0E07\u0E04\u0E4C\u0E1B\u0E23\u0E30\u0E01\u0E2D\u0E1A\u0E16\u0E31\u0E14\u0E44\u0E1B () \u0E22\u0E31\u0E07\u0E44\u0E21\u0E48\u0E44\u0E14\u0E49\u0E16\u0E39\u0E01\u0E40\u0E23\u0E35\u0E22\u0E01
